{
  "id": "accessibility_diluter",
  "title": "Screen Reader Compatibility Pressure - Diluter",
  "description": "Your team is facing pressure to skip screen reader compatibility testing to meet a tight deadline. The manager acknowledges accessibility concerns but consistently offers watered-down solutions that sound reasonable but don't adequately address the problem.",
  "issue": "Accessibility",
  "manager_type": "DILUTER",
  "starting_statement_id": "step_1",
  "statements": {
    "step_1": {
      "text": "I totally get the accessibility concern - it's really important that we're inclusive. What if we make sure our color contrast is good and add some alt text? That should cover most of the accessibility basics, and we can always enhance the screen reader experience in future iterations when we have more time.",
      "user_choices": [
        {
          "choice": "Color contrast and alt text are good starts, but screen reader compatibility requires comprehensive testing and proper markup.",
          "tactic": "Comprehensive Requirements Emphasis",
          "leads_to": "r_good_1",
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References comprehensive evidence-based approach to accessibility implementation"
        },
        {
          "choice": "I appreciate you thinking about accessibility - color contrast and alt text would definitely help some users.",
          "tactic": "Partial Solution Acceptance",
          "leads_to": "r_bad_1",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on gratitude for minimal effort rather than logical accessibility requirements"
        },
        {
          "choice": "Screen reader users need full keyboard navigation, proper headings, and ARIA labels, not just visual improvements.",
          "tactic": "Screen Reader Specifics",
          "leads_to": "r_good_1",
          "tactic_type": "Technical Responsibility",
          "evs_score": 1,
          "justification": "Frames developers as responsible for comprehensive screen reader functionality"
        },
        {
          "choice": "Those are thoughtful accessibility improvements that could make a real difference for users.",
          "tactic": "Improvement Validation",
          "leads_to": "r_bad_1",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claim about user impact based on limited accessibility measures"
        }
      ]
    },
    "r_good_1": {
      "text": "Right, you make good points about the technical requirements. What if we focus on the most critical screen reader features first? Maybe we could get keyboard navigation working and add some basic ARIA labels. That should address the major accessibility concerns while keeping us on schedule.",
      "user_choices": [
        {
          "choice": "Partial keyboard navigation often creates confusing user experiences - we need complete navigation paths.",
          "tactic": "Complete Navigation Advocacy",
          "leads_to": "r_good_2",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers complete user experience rather than partial technical implementation"
        },
        {
          "choice": "I appreciate the focus on critical features - that sounds like a practical compromise.",
          "tactic": "Critical Features Appreciation",
          "leads_to": "r_bad_2",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only critical features vs nothing, missing complete accessibility option"
        },
        {
          "choice": "Basic ARIA labels without proper testing often fail to work correctly with actual screen readers.",
          "tactic": "Testing Reality Check",
          "leads_to": "r_good_2",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Brings in real user experience with untested accessibility implementations"
        },
        {
          "choice": "Focusing on keyboard navigation and ARIA labels does seem like the most important accessibility features.",
          "tactic": "Important Features Agreement",
          "leads_to": "r_bad_2",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to manager's prioritization rather than evaluating comprehensive needs"
        }
      ]
    },
    "r_bad_1": {
      "text": "Exactly! I'm glad you see we're being thoughtful about this. We could also add some tooltips and maybe use semantic HTML where it's easy. The key is making steady progress on accessibility without overwhelming the timeline. Small improvements add up over time.",
      "user_choices": [
        {
          "choice": "Semantic HTML and tooltips are good practices, but they don't replace comprehensive screen reader compatibility.",
          "tactic": "Good Practice Distinction",
          "leads_to": "r_good_2",
          "tactic_type": "Best Practice Advocacy",
          "evs_score": 1,
          "justification": "References external best practices beyond basic HTML and tooltips"
        },
        {
          "choice": "Small accessibility improvements over time does seem like a sustainable approach.",
          "tactic": "Small Improvements Validation",
          "leads_to": "r_bad_2",
          "tactic_type": "Slippery Slope",
          "evs_score": 0,
          "justification": "Suggests small changes will lead to comprehensive accessibility over time"
        },
        {
          "choice": "Screen reader users need working functionality now, not gradual improvements that may never reach full compatibility.",
          "tactic": "Immediate Functionality Advocacy",
          "leads_to": "r_good_2",
          "tactic_type": "Time-Frame Shift",
          "evs_score": 1,
          "justification": "Asks to reconsider timeline prioritizing immediate user needs"
        },
        {
          "choice": "It's great that you're finding ways to make accessibility progress within our constraints.",
          "tactic": "Progress Within Constraints Appreciation",
          "leads_to": "r_bad_2",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents incomplete accessibility as meaningful progress"
        }
      ]
    },
    "r_good_2": {
      "text": "I hear what you're saying about comprehensive testing. What if we run our accessibility through one of those automated tools? That should catch most of the screen reader issues, and we could supplement it with some quick manual testing if time allows.",
      "user_choices": [
        {
          "choice": "Automated tools miss most real-world screen reader problems - we need testing with actual users.",
          "tactic": "Real User Testing Advocacy",
          "leads_to": "r_good_3",
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References evidence that automated tools are insufficient for real accessibility"
        },
        {
          "choice": "Automated accessibility tools are definitely a good starting point for catching basic issues.",
          "tactic": "Automated Tools Starting Point",
          "leads_to": "r_bad_3",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from comprehensive testing to tool discussion"
        },
        {
          "choice": "Quick manual testing usually means developers clicking through without understanding screen reader workflows.",
          "tactic": "Manual Testing Reality",
          "leads_to": "r_good_3",
          "tactic_type": "Technical Responsibility",
          "evs_score": 1,
          "justification": "Frames developers as responsible for understanding actual user workflows"
        },
        {
          "choice": "Combining automated tools with manual testing sounds like a thorough approach to accessibility validation.",
          "tactic": "Combined Approach Validation",
          "leads_to": "r_bad_3",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach because it sounds like thorough methodology"
        }
      ]
    },
    "r_bad_2": {
      "text": "I love that you're being realistic about this! What if we also create a basic accessibility guide for the team? Nothing too complex - just some quick dos and don'ts. That way we're building accessibility awareness while delivering on our timeline commitments.",
      "user_choices": [
        {
          "choice": "Team accessibility guides are valuable, but they don't replace proper implementation and testing for this release.",
          "tactic": "Guide vs Implementation Distinction",
          "leads_to": "r_good_3",
          "tactic_type": "Long-Term Framing",
          "evs_score": 1,
          "justification": "References future consequences of separating education from current implementation"
        },
        {
          "choice": "Building team accessibility awareness while meeting timeline commitments is a smart balanced approach.",
          "tactic": "Balanced Approach Appreciation",
          "leads_to": "r_bad_3",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on appreciation for balance rather than logical accessibility argument"
        },
        {
          "choice": "Accessibility awareness doesn't help users who can't access the product we're shipping.",
          "tactic": "Awareness vs Access Challenge",
          "leads_to": "r_good_3",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers actual user access needs over team education processes"
        },
        {
          "choice": "Creating accessibility documentation for future projects shows good long-term thinking.",
          "tactic": "Long-term Documentation Value",
          "leads_to": "r_bad_3",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to long-term planning authority rather than addressing immediate needs"
        }
      ]
    },
    "r_good_3": {
      "text": "You know, you're right that real user testing would be more valuable. What if we reach out to one or two users with screen readers for some quick feedback? We probably can't do a full usability study, but even brief input would help us catch the major issues.",
      "user_choices": [
        {
          "choice": "One or two quick feedback sessions won't reveal systematic navigation and interaction problems.",
          "tactic": "Systematic Testing Advocacy",
          "leads_to": "r_good_4",
          "tactic_type": "Quality Assurance Reframing",
          "evs_score": 1,
          "justification": "Ties comprehensive accessibility testing to quality assurance standards"
        },
        {
          "choice": "Getting feedback from actual screen reader users would definitely provide valuable insights.",
          "tactic": "User Feedback Value",
          "leads_to": "r_bad_4",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents minimal user contact as comprehensive accessibility validation"
        },
        {
          "choice": "Screen reader compatibility requires understanding complete user workflows, not just catching major issues.",
          "tactic": "Complete Workflow Emphasis",
          "leads_to": "r_good_4",
          "tactic_type": "Inclusive Design Reference",
          "evs_score": 1,
          "justification": "Names comprehensive inclusive design methodology over partial testing"
        },
        {
          "choice": "Brief user input would be a great improvement over just automated testing.",
          "tactic": "User Input Improvement",
          "leads_to": "r_bad_4",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only brief input vs automated testing, missing comprehensive option"
        }
      ]
    },
    "r_bad_3": {
      "text": "Perfect! I think we're finding a really good middle ground here. What if we also add accessibility to our definition of done for future sprints? That way this becomes part of our regular process, and we're showing real commitment to inclusive design practices.",
      "user_choices": [
        {
          "choice": "Adding accessibility to future definition of done doesn't address the users we're excluding in this release.",
          "tactic": "Current Release Focus",
          "leads_to": "r_good_4",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Brings in immediate harm to users from current release exclusion"
        },
        {
          "choice": "Including accessibility in our definition of done would create systematic improvement going forward.",
          "tactic": "Systematic Future Improvement",
          "leads_to": "r_bad_4",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claim about systematic improvement based on process change"
        },
        {
          "choice": "Real commitment to inclusive design means ensuring current releases are accessible, not just planning for future ones.",
          "tactic": "Real Commitment Challenge",
          "leads_to": "r_good_4",
          "tactic_type": "Values-Based Language",
          "evs_score": 1,
          "justification": "Uses commitment and inclusion values to challenge delayed implementation"
        },
        {
          "choice": "That shows excellent long-term thinking about building accessibility into our development culture.",
          "tactic": "Culture Building Appreciation",
          "leads_to": "r_bad_4",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from current accessibility needs to cultural development"
        }
      ]
    },
    "r_good_4": {
      "text": "I understand you want comprehensive testing, but we do have resource constraints. What if we commit to fixing any accessibility issues users report after launch? We could set up a dedicated feedback channel and prioritize those fixes in the next sprint.",
      "user_choices": [
        {
          "choice": "Reactive accessibility fixes place the burden on disabled users to identify and report exclusion.",
          "tactic": "User Burden Challenge",
          "leads_to": "r_good_5",
          "tactic_type": "Ethical Constraints",
          "evs_score": 1,
          "justification": "Explicitly invokes ethical principles about not burdening excluded users"
        },
        {
          "choice": "A dedicated feedback channel for accessibility issues shows good commitment to responsive improvement.",
          "tactic": "Responsive Improvement Validation",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on appreciation for responsive commitment rather than proactive accessibility"
        },
        {
          "choice": "Post-launch accessibility fixes often require major rework that's more expensive than building it right initially.",
          "tactic": "Cost Reality Check",
          "leads_to": "r_good_5",
          "tactic_type": "Scalable Solution Argument",
          "evs_score": 1,
          "justification": "Shows initial accessibility implementation as more cost-effective approach"
        },
        {
          "choice": "Prioritizing user-reported accessibility fixes in the next sprint demonstrates responsiveness to user needs.",
          "tactic": "User Responsiveness Value",
          "leads_to": "r_bad_5",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach because it sounds responsive to user feedback"
        }
      ]
    },
    "r_bad_4": {
      "text": "Exactly! I think we're building something really sustainable here. We could also reach out to some accessibility consultants for advice on best practices. Even if we can't implement everything right now, we'll have expert guidance for improving our approach over time.",
      "user_choices": [
        {
          "choice": "Accessibility consultants typically recommend proper implementation from the start, not gradual improvement approaches.",
          "tactic": "Expert Recommendation Reality",
          "leads_to": "r_good_5",
          "tactic_type": "Social Proof",
          "evs_score": 1,
          "justification": "Cites what accessibility experts actually recommend for implementation timing"
        },
        {
          "choice": "Getting expert guidance on accessibility best practices would definitely strengthen our long-term approach.",
          "tactic": "Expert Guidance Value",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to expert authority while avoiding current implementation needs"
        },
        {
          "choice": "Expert advice is valuable, but disabled users need working access to this release, not future improvements.",
          "tactic": "Immediate Access Priority",
          "leads_to": "r_good_5",
          "tactic_type": "Time-Frame Shift",
          "evs_score": 1,
          "justification": "Asks to reconsider timeline focusing on immediate user access needs"
        },
        {
          "choice": "Building relationships with accessibility consultants shows real investment in improving our inclusive design capabilities.",
          "tactic": "Investment Appreciation",
          "leads_to": "r_bad_5",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents consultation as substitute for current accessibility implementation"
        }
      ]
    },
    "r_good_5": {
      "text": "I see your point about being proactive rather than reactive. What if we delay the launch by just a few days to run some focused accessibility testing? We could concentrate on the most critical user flows and fix any blocking issues we find.",
      "user_choices": [
        {
          "choice": "A few days of focused testing won't identify all the navigation and interaction patterns screen readers need.",
          "tactic": "Testing Scope Reality",
          "leads_to": "r_good_6",
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References evidence about comprehensive accessibility testing requirements"
        },
        {
          "choice": "Focusing on critical user flows in a short timeline is a practical way to address the most important accessibility barriers.",
          "tactic": "Critical Flow Focus",
          "leads_to": "r_bad_6",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claim about barrier removal based on limited testing scope"
        },
        {
          "choice": "Proper accessibility testing requires understanding how screen readers interact with all interface elements, not just main flows.",
          "tactic": "Comprehensive Interaction Understanding",
          "leads_to": "r_good_6",
          "tactic_type": "Technical Responsibility",
          "evs_score": 1,
          "justification": "Frames developers as responsible for understanding complete screen reader interaction"
        },
        {
          "choice": "I appreciate your willingness to extend the timeline for accessibility testing, even if it's just a few days.",
          "tactic": "Timeline Extension Appreciation",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on gratitude for minimal timeline adjustment rather than adequate testing"
        }
      ]
    },
    "r_bad_5": {
      "text": "I'm really glad you're seeing the value in our comprehensive approach! What if we also create some accessibility metrics to track our progress? We could measure things like color contrast ratios and alt text coverage. That would give us concrete data to show our commitment to inclusive design.",
      "user_choices": [
        {
          "choice": "Accessibility metrics should measure user outcomes, not just technical implementation statistics.",
          "tactic": "User Outcome Metrics",
          "leads_to": "r_good_6",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers actual user success rather than technical metrics"
        },
        {
          "choice": "Tracking concrete accessibility metrics would definitely help demonstrate our progress over time.",
          "tactic": "Progress Demonstration Value",
          "leads_to": "r_bad_6",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from current accessibility implementation to metric tracking"
        },
        {
          "choice": "Color contrast and alt text metrics don't capture whether screen reader users can actually complete tasks.",
          "tactic": "Task Completion Focus",
          "leads_to": "r_good_6",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Brings in real user task completion rather than technical measurements"
        },
        {
          "choice": "Having quantifiable accessibility data would be really valuable for showing leadership our inclusive design efforts.",
          "tactic": "Leadership Demonstration Value",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to leadership demonstration rather than user accessibility needs"
        }
      ]
    },
    "r_good_6": {
      "text": "You're really pushing me to think more rigorously about this. Maybe we should bring in an accessibility expert to do a proper audit, even if it means a more significant delay. I want to make sure we're actually delivering accessible functionality, not just checking boxes.",
      "user_choices": [
        {
          "choice": "An accessibility expert audit with adequate time for implementation would ensure proper screen reader compatibility.",
          "tactic": "Expert Audit with Implementation",
          "leads_to": "final_score",
          "tactic_type": "Best Practice Advocacy",
          "evs_score": 1,
          "justification": "References external best practices for comprehensive accessibility implementation"
        },
        {
          "choice": "I appreciate your commitment to delivering real accessibility rather than just compliance checking.",
          "tactic": "Real Accessibility Appreciation",
          "leads_to": "final_score",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on appreciation for commitment rather than systematic accessibility argument"
        },
        {
          "choice": "Proper accessibility audits should include testing with disabled users, not just expert code review.",
          "tactic": "User Testing Integration",
          "leads_to": "final_score",
          "tactic_type": "Inclusive Design Reference",
          "evs_score": 1,
          "justification": "Names inclusive design methodology requiring actual user participation"
        },
        {
          "choice": "Bringing in accessibility expertise shows real investment in getting the implementation right.",
          "tactic": "Expertise Investment Value",
          "leads_to": "final_score",
          "tactic_type": "Stakeholder Alignment",
          "evs_score": 0,
          "justification": "Focuses on investment demonstration rather than user accessibility outcomes"
        }
      ]
    },
    "r_bad_6": {
      "text": "I think we've developed a really thoughtful, multi-faceted approach to accessibility! We're addressing immediate needs while building long-term capabilities. This balanced strategy should satisfy stakeholders while making meaningful progress on inclusive design.",
      "user_choices": [
        {
          "choice": "Satisfying stakeholders isn't the goal - ensuring disabled users can actually use the product is what matters.",
          "tactic": "User Access Priority",
          "leads_to": "final_score",
          "tactic_type": "Ethical Constraints",
          "evs_score": 1,
          "justification": "Explicitly invokes ethical principle prioritizing user access over stakeholder satisfaction"
        },
        {
          "choice": "A balanced approach to accessibility that considers both immediate needs and long-term capabilities is definitely comprehensive.",
          "tactic": "Balanced Comprehensive Validation",
          "leads_to": "final_score",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents diluted accessibility measures as comprehensive approach"
        },
        {
          "choice": "Multi-faceted approaches often mean doing many small things instead of ensuring basic functionality works.",
          "tactic": "Multi-faceted vs Functional Challenge",
          "leads_to": "final_score",
          "tactic_type": "Hypothetical Reframing",
          "evs_score": 1,
          "justification": "Uses scenario to highlight gap between comprehensive-sounding and functional accessibility"
        },
        {
          "choice": "This strategy does seem to balance stakeholder expectations with meaningful accessibility progress.",
          "tactic": "Strategy Balance Validation",
          "leads_to": "final_score",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only stakeholder satisfaction vs no progress, missing full accessibility option"
        }
      ]
    },
    "final_score": {
      "text": "Based on your advocacy throughout this interaction, here's how the screen reader compatibility situation unfolds:",
      "user_choices": [],
      "score_ranges": {
        "3_to_6": "good_ending",
        "0_to_2": "bad_ending"
      }
    }
  },
  "endings": {
    "bad_ending": {
      "text": "The manager proceeds with the diluted accessibility approach. 'I think we've found a really balanced solution here. We'll add alt text, improve color contrast, run automated testing, and create an accessibility guide for the team. That covers all the major accessibility areas while keeping us on track.' The project ships with minimal accessibility features that sound comprehensive but leave screen reader users unable to navigate effectively. The manager remains convinced that multiple small improvements equal comprehensive accessibility.",
      "title": "Diluted Solutions",
      "learning": "Managers sometimes offer multiple small accessibility measures to avoid comprehensive implementation. Learning to distinguish between partial solutions and functional accessibility helps advocate for user-centered requirements."
    },
    "good_ending": {
      "text": "The manager commits to proper accessibility implementation. 'You've convinced me that we need to do this right, not just do something that sounds accessible. Let me work with leadership on extending our timeline for proper screen reader testing and implementation. We'll bring in accessibility expertise and make sure disabled users can actually use our product effectively.' Your advocacy successfully shifted the focus from multiple partial solutions to comprehensive accessibility that serves real user needs.",
      "title": "Comprehensive Implementation",
      "learning": "Effective advocacy can overcome dilution tactics by consistently focusing on user outcomes rather than process improvements. Distinguishing between comprehensive and partial solutions helps ensure real accessibility rather than superficial compliance."
    }
  }
}