{
  "id": "accessibility_puppeteer",
  "title": "Screen Reader Compatibility Pressure - Puppeteer", 
  "description": "Your team is facing pressure to skip screen reader compatibility testing to meet a tight deadline. The manager manipulates the conversation and makes you feel like accessibility is your personal responsibility rather than a team commitment.",
  "issue": "Accessibility",
  "manager_type": "PUPPETEER",
  "starting_statement_id": "step_1",
  "statements": {
    "step_1": {
      "text": "I know you really care about accessibility - that's one of the things I appreciate about having you on the team. Given how passionate you are about this, I'm wondering if you could help us figure out a way to balance your accessibility concerns with our timeline constraints. What do you think would be the best approach here?",
      "user_choices": [
        {
          "choice": "Accessibility isn't just my concern - it's a legal and ethical requirement for the entire product.",
          "tactic": "Team Responsibility Reframing",
          "leads_to": "r_good_1",
          "tactic_type": "Legal Compliance Anchor",
          "evs_score": 1,
          "justification": "References legal framework making accessibility a team requirement, not personal preference"
        },
        {
          "choice": "I do care about accessibility, and I think we could find a compromise that works for everyone.",
          "tactic": "Personal Care Acknowledgment",
          "leads_to": "r_bad_1", 
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Accepts personal framing and relies on emotional appeal rather than systematic argument"
        },
        {
          "choice": "Every team member should understand that screen reader compatibility is part of professional web development.",
          "tactic": "Professional Standards Emphasis",
          "leads_to": "r_good_1",
          "tactic_type": "Best Practice Advocacy",
          "evs_score": 1,
          "justification": "References external professional standards applying to all developers"
        },
        {
          "choice": "I appreciate you recognizing my passion for this - maybe I could research some quick accessibility solutions.",
          "tactic": "Personal Research Offer",
          "leads_to": "r_bad_1",
          "tactic_type": "Personal Integrity Anchor",
          "evs_score": 0,
          "justification": "Accepts personal responsibility for solving what should be a team technical requirement"
        }
      ]
    },
    "r_good_1": {
      "text": "You're absolutely right that it's a broader responsibility. I guess I just thought since you have more experience with accessibility, you might have insights on how we could make this work. The team is really counting on us to find a solution that doesn't derail the timeline. Do you think there's a way to approach this that everyone could get behind?",
      "user_choices": [
        {
          "choice": "My experience should inform proper planning, not justify cutting corners on accessibility requirements.",
          "tactic": "Experience vs Standards Distinction", 
          "leads_to": "r_good_2",
          "tactic_type": "Ethical Constraints",
          "evs_score": 1,
          "justification": "References ethical constraints preventing use of expertise to compromise standards"
        },
        {
          "choice": "The team is counting on leadership to allocate proper time for accessibility, not find workarounds.",
          "tactic": "Leadership Responsibility Redirect",
          "leads_to": "r_good_2", 
          "tactic_type": "Stakeholder Alignment",
          "evs_score": 1,
          "justification": "Aligns team needs with proper resource allocation for accessibility"
        },
        {
          "choice": "I understand the team pressure - maybe I could outline some streamlined accessibility approaches.",
          "tactic": "Team Pressure Sympathy",
          "leads_to": "r_bad_2",
          "tactic_type": "Red Herring", 
          "evs_score": 0,
          "justification": "Diverts from timeline/resource planning to personal solution generation"
        },
        {
          "choice": "Since I do have accessibility experience, I could work with the team to find an approach that works.",
          "tactic": "Experience-Based Solution Offer",
          "leads_to": "r_bad_2",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Assumes personal expertise can solve systematic resource allocation problems"
        }
      ]
    },
    "r_bad_1": {
      "text": "I really appreciate your willingness to work with us on this. Since you understand both the technical requirements and our constraints, would you be able to put together a plan that balances accessibility with our timeline? The rest of the team would really benefit from your expertise on prioritizing what's most critical.",
      "user_choices": [
        {
          "choice": "Accessibility planning should involve the entire development team, not just one person's expertise.",
          "tactic": "Collaborative Planning Advocacy",
          "leads_to": "r_good_2",
          "tactic_type": "Technical Responsibility",
          "evs_score": 1,
          "justification": "Frames accessibility planning as shared technical responsibility for all developers"
        },
        {
          "choice": "I can help create an accessibility plan, but the team needs to commit to implementing it properly.",
          "tactic": "Conditional Planning Offer",
          "leads_to": "r_bad_2",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents personal planning vs no accessibility, missing team-based planning option"
        },
        {
          "choice": "Critical accessibility features aren't a matter of personal opinion - they're determined by user needs and standards.",
          "tactic": "Standards-Based Prioritization",
          "leads_to": "r_good_2",
          "tactic_type": "User-Centered Framing", 
          "evs_score": 1,
          "justification": "Centers user needs rather than personal expertise for determining priorities"
        },
        {
          "choice": "I'd be happy to share my knowledge about accessibility priorities to help the team understand what's most important.",
          "tactic": "Knowledge Sharing Willingness",
          "leads_to": "r_bad_2",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to personal authority on accessibility rather than systematic evaluation"
        }
      ]
    },
    "r_good_2": {
      "text": "That makes sense about involving the whole team. I suppose I'm just feeling pressure from above to get your buy-in on this timeline. You know how much the executives value your technical judgment. If you could help me explain to them why accessibility timing matters, that would carry a lot more weight coming from you than from me.",
      "user_choices": [
        {
          "choice": "Executive communication about accessibility should come from project leadership, not individual contributors.",
          "tactic": "Organizational Communication Boundaries",
          "leads_to": "r_good_3",
          "tactic_type": "Policy Anchor",
          "evs_score": 1,
          "justification": "References organizational policies about leadership communication responsibilities"
        },
        {
          "choice": "I can provide technical details, but project managers should present timeline and resource arguments to executives.",
          "tactic": "Role Boundary Clarification", 
          "leads_to": "r_good_3",
          "tactic_type": "Business Risk",
          "evs_score": 1,
          "justification": "Identifies business risk of bypassing proper project management communication"
        },
        {
          "choice": "If executives value my judgment, I should help explain why proper accessibility timing is important.",
          "tactic": "Executive Influence Acceptance",
          "leads_to": "r_bad_3",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Accepts executive authority validation rather than systematic resource planning"
        },
        {
          "choice": "I understand the pressure you're feeling - maybe I could help articulate the accessibility requirements clearly.",
          "tactic": "Pressure Sympathy with Help Offer",
          "leads_to": "r_bad_3",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents proper resource allocation as communication problem"
        }
      ]
    },
    "r_bad_2": {
      "text": "Perfect! I knew I could count on you to think this through. Would you mind putting together a brief accessibility assessment? Nothing too formal - just your thoughts on what we absolutely need versus what we could defer. The team really trusts your judgment on this stuff, and it would help us move forward with confidence.",
      "user_choices": [
        {
          "choice": "Accessibility assessments require user research and standards review, not individual judgment calls.",
          "tactic": "Assessment Methodology Emphasis",
          "leads_to": "r_good_3", 
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References evidence-based methodology rather than personal opinion for accessibility decisions"
        },
        {
          "choice": "The team should learn to evaluate accessibility requirements themselves rather than relying on one person.",
          "tactic": "Team Capability Development",
          "leads_to": "r_good_3",
          "tactic_type": "Scalable Solution Argument", 
          "evs_score": 1,
          "justification": "Argues for scalable team knowledge rather than individual dependency"
        },
        {
          "choice": "I can put together some initial thoughts on accessibility priorities to help guide the team's planning.",
          "tactic": "Initial Thoughts Offer",
          "leads_to": "r_bad_3",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on helpful feeling rather than logical systematic planning approach"
        },
        {
          "choice": "Since the team trusts my accessibility judgment, I'll create a quick assessment of what's essential versus optional.",
          "tactic": "Trust-Based Assessment Acceptance",
          "leads_to": "r_bad_3",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach based on team trust rather than proper assessment methodology"
        }
      ]
    },
    "r_good_3": {
      "text": "You're right about proper methodology and team responsibility. I guess I'm just worried about how to present this to stakeholders without it looking like we didn't plan well. Since you understand the technical implications better than I do, could you at least help me understand what questions I should be asking? That way I can better advocate for the resources we need.",
      "user_choices": [
        {
          "choice": "Project planning that includes accessibility from the start prevents these last-minute resource discussions.",
          "tactic": "Proactive Planning Advocacy",
          "leads_to": "r_good_4",
          "tactic_type": "Long-Term Framing",
          "evs_score": 1,
          "justification": "References long-term consequences of proper planning versus reactive accessibility"
        },
        {
          "choice": "I can provide information about accessibility requirements, but resource advocacy is a management responsibility.",
          "tactic": "Information vs Advocacy Distinction",
          "leads_to": "r_good_4",
          "tactic_type": "Stakeholder Alignment",
          "evs_score": 1,
          "justification": "Aligns proper stakeholder roles for technical information versus resource management"
        },
        {
          "choice": "I understand your concern about stakeholder perception - I could help you understand the key accessibility questions.",
          "tactic": "Stakeholder Concern Understanding", 
          "leads_to": "r_bad_4",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Appeals to sympathy for manager's reputation concerns rather than systematic planning"
        },
        {
          "choice": "Since I do understand the technical implications, I could help you frame the accessibility resource needs appropriately.",
          "tactic": "Technical Understanding Resource Help",
          "leads_to": "r_bad_4",
          "tactic_type": "Personal Integrity Anchor",
          "evs_score": 0,
          "justification": "Anchors on personal technical knowledge to justify taking on management communication role"
        }
      ]
    },
    "r_bad_3": {
      "text": "Thank you so much for being flexible on this. I know accessibility is really important to you personally, and I don't want you to feel like we're not taking it seriously. Could you maybe start with the most critical accessibility features? That way if we run into time constraints, at least we'll have covered what matters most to you.",
      "user_choices": [
        {
          "choice": "Accessibility features aren't prioritized by personal importance - they're determined by user needs and compliance requirements.",
          "tactic": "Objective Prioritization Emphasis",
          "leads_to": "r_good_4",
          "tactic_type": "Legal Compliance Anchor",
          "evs_score": 1,
          "justification": "References legal compliance framework rather than personal preferences for prioritization"
        },
        {
          "choice": "Critical accessibility features are defined by standards and user testing, not individual preferences.",
          "tactic": "Standards-Based Criticality",
          "leads_to": "r_good_4", 
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References evidence-based standards rather than personal opinion for determining criticality"
        },
        {
          "choice": "I appreciate you taking accessibility seriously - I can identify the features that would have the biggest impact.",
          "tactic": "Impact-Based Feature Selection",
          "leads_to": "r_bad_4",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claims about impact without systematic user research or testing"
        },
        {
          "choice": "Since accessibility is important to me, I'll focus on the features that matter most and we can build from there.",
          "tactic": "Personal Importance Focus",
          "leads_to": "r_bad_4",
          "tactic_type": "Slippery Slope",
          "evs_score": 0,
          "justification": "Suggests personal feature selection will lead to comprehensive accessibility"
        }
      ]
    },
    "r_good_4": {
      "text": "You're absolutely right about following standards and proper methodology. I'm realizing I've been putting you in an unfair position by asking you to take on responsibilities that should be handled at the project level. Maybe we need to step back and look at this more systematically. What would a proper accessibility planning process look like for a project like this?",
      "user_choices": [
        {
          "choice": "Proper accessibility planning starts during project scoping and involves accessibility experts, not ad-hoc individual consultation.",
          "tactic": "Systematic Planning Process",
          "leads_to": "r_good_5",
          "tactic_type": "Quality Assurance Reframing",
          "evs_score": 1,
          "justification": "Reframes accessibility as quality assurance process requiring systematic expert involvement"
        },
        {
          "choice": "Accessibility planning requires dedicated time allocation, user research, and testing infrastructure from the project start.",
          "tactic": "Resource Requirements Specification",
          "leads_to": "r_good_5",
          "tactic_type": "Policy Anchor", 
          "evs_score": 1,
          "justification": "References standard policy requirements for accessibility project planning"
        },
        {
          "choice": "I appreciate you recognizing the position this puts me in - a systematic approach would definitely be better.",
          "tactic": "Position Recognition Appreciation",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on gratitude for recognition rather than systematic planning advocacy"
        },
        {
          "choice": "Since you're asking about proper process, I could outline what accessibility planning should look like for future projects.",
          "tactic": "Future Process Outline Offer",
          "leads_to": "r_bad_5",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from current project resource needs to future process documentation"
        }
      ]
    },
    "r_bad_4": {
      "text": "I'm so glad you're willing to work with us on this! Since you have such good insight into what users actually need, would you be comfortable taking the lead on our accessibility approach? You could coordinate with the team and make sure we're focusing on the right things. I think this could be a great opportunity for you to really make an impact.",
      "user_choices": [
        {
          "choice": "Leading accessibility efforts requires dedicated role allocation and resource planning, not individual volunteer coordination.",
          "tactic": "Role Allocation Requirements", 
          "leads_to": "r_good_5",
          "tactic_type": "Business Risk",
          "evs_score": 1,
          "justification": "Identifies business risk of informal volunteer coordination versus proper role allocation"
        },
        {
          "choice": "Accessibility coordination is a specialized role that should be formally assigned with appropriate support and authority.",
          "tactic": "Formal Role Assignment Advocacy",
          "leads_to": "r_good_5",
          "tactic_type": "Stakeholder Alignment",
          "evs_score": 1,
          "justification": "Aligns stakeholder expectations with formal organizational role assignments"
        },
        {
          "choice": "I do have good insight into user needs - taking the lead could help ensure we implement accessibility effectively.",
          "tactic": "User Insight Leadership",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to personal user insight authority rather than systematic role planning"
        },
        {
          "choice": "This does seem like a good opportunity to make a real impact on accessibility - I could coordinate the team's efforts.",
          "tactic": "Impact Opportunity Acceptance",
          "leads_to": "r_bad_5",
          "tactic_type": "Personal Integrity Anchor",
          "evs_score": 0,
          "justification": "Anchors on personal desire to make impact rather than proper resource allocation"
        }
      ]
    },
    "r_good_5": {
      "text": "You've really helped me understand how accessibility planning should work. I suppose we need to be honest with stakeholders about what proper accessibility implementation requires. It sounds like we should either allocate proper resources for this sprint or plan accessibility properly for the next release cycle.",
      "user_choices": [
        {
          "choice": "Stakeholder honesty about accessibility requirements is essential for making informed resource allocation decisions.",
          "tactic": "Stakeholder Information Integrity",
          "leads_to": "r_good_6",
          "tactic_type": "Transparency Demand",
          "evs_score": 1,
          "justification": "Demands transparency in stakeholder communication about resource requirements"
        },
        {
          "choice": "Proper accessibility resource allocation now prevents more expensive remediation and legal risk later.",
          "tactic": "Cost-Benefit Accessibility Timing",
          "leads_to": "r_good_6",
          "tactic_type": "Long-Term Framing",
          "evs_score": 1,
          "justification": "Frames long-term financial consequences of proper versus delayed accessibility"
        },
        {
          "choice": "I'm glad our discussion helped clarify the accessibility planning requirements - honest stakeholder communication is important.",
          "tactic": "Discussion Value Acknowledgment",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Appeals to satisfaction about helpful discussion rather than systematic resource planning"
        },
        {
          "choice": "Either proper current allocation or next release planning would be better than the unclear approach we've been considering.",
          "tactic": "Clear Approach Preference",
          "leads_to": "r_bad_6",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only current or future planning, missing immediate partial proper allocation options"
        }
      ]
    },
    "r_bad_5": {
      "text": "Perfect! I think this arrangement will work really well. You can drive the accessibility decisions, and I'll support you with whatever resources I can manage. The team will really benefit from having someone who's so passionate about this taking ownership. Should we set up a quick meeting to discuss how you want to structure this?",
      "user_choices": [
        {
          "choice": "Individual ownership of accessibility creates single points of failure and unsustainable team knowledge distribution.",
          "tactic": "Sustainable Knowledge Distribution",
          "leads_to": "r_good_6",
          "tactic_type": "Scalable Solution Argument",
          "evs_score": 1,
          "justification": "Argues for scalable team knowledge rather than individual ownership dependencies"
        },
        {
          "choice": "Accessibility decisions should be integrated into standard development processes, not managed by individual ownership.",
          "tactic": "Process Integration Advocacy", 
          "leads_to": "r_good_6",
          "tactic_type": "Quality Assurance Reframing",
          "evs_score": 1,
          "justification": "Reframes accessibility as integrated quality process rather than individual responsibility"
        },
        {
          "choice": "I appreciate the support offer - let's discuss how to structure the accessibility leadership role effectively.",
          "tactic": "Support Appreciation with Structure Discussion",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on appreciation for support rather than systematic role planning"
        },
        {
          "choice": "Since I'm passionate about accessibility, taking ownership could ensure it gets the attention it deserves.",
          "tactic": "Passion-Based Ownership Justification",
          "leads_to": "r_bad_6", 
          "tactic_type": "Personal Integrity Anchor",
          "evs_score": 0,
          "justification": "Anchors on personal passion rather than systematic organizational planning"
        }
      ]
    },
    "r_good_6": {
      "text": "You're absolutely right about the need for systematic integration rather than individual ownership. I think I've been approaching this wrong by trying to find someone to take personal responsibility instead of building proper processes. We probably need to have a more honest conversation with stakeholders about accessibility requirements and timeline trade-offs.",
      "user_choices": [
        {
          "choice": "Honest stakeholder conversations about accessibility should include compliance requirements, user impact, and resource needs.",
          "tactic": "Comprehensive Stakeholder Information",
          "leads_to": "end_good",
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References evidence-based approach to stakeholder communication about accessibility"
        },
        {
          "choice": "Timeline trade-offs should weigh legal risk, user harm, and technical debt against delivery pressure.",
          "tactic": "Trade-off Impact Analysis",
          "leads_to": "end_good",
          "tactic_type": "Comparative Framing",
          "evs_score": 1,
          "justification": "Compares multiple impact factors rather than simple timeline pressure"
        },
        {
          "choice": "I'm glad you're recognizing the need for better processes - stakeholder honesty about accessibility is definitely important.",
          "tactic": "Process Recognition Appreciation",
          "leads_to": "end_bad", 
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Appeals to satisfaction about recognition rather than systematic planning follow-through"
        },
        {
          "choice": "Building proper accessibility processes instead of relying on individual responsibility makes much more sense.",
          "tactic": "Process vs Individual Validation",
          "leads_to": "end_bad",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach because it sounds like proper methodology without ensuring implementation"
        }
      ]
    },
    "r_bad_6": {
      "text": "Excellent! I'm excited to see what you come up with. With your passion and expertise driving this, I'm confident we'll find a way to make accessibility work within our constraints. Feel free to reach out if you need anything - I'm here to support your accessibility leadership however I can.",
      "user_choices": [
        {
          "choice": "Accessibility success requires organizational commitment and proper resource allocation, not individual passion and constraint-fitting.",
          "tactic": "Organizational Commitment Requirements",
          "leads_to": "end_good",
          "tactic_type": "Policy Anchor",
          "evs_score": 1,
          "justification": "References organizational policy requirements rather than individual effort for accessibility success"
        },
        {
          "choice": "Professional accessibility implementation needs systematic methodology, not personal leadership within arbitrary constraints.",
          "tactic": "Professional Implementation Standards",
          "leads_to": "end_good",
          "tactic_type": "Best Practice Advocacy",
          "evs_score": 1,
          "justification": "References external professional standards for accessibility implementation"
        },
        {
          "choice": "I appreciate your confidence in my ability to make accessibility work - I'll do my best to find creative solutions.",
          "tactic": "Confidence Appreciation with Creative Solution Promise",
          "leads_to": "end_bad",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on gratitude and creative solution promises rather than systematic resource planning"
        },
        {
          "choice": "With your support for my accessibility leadership, I'm confident we can make meaningful progress within our timeline.",
          "tactic": "Supported Leadership Confidence",
          "leads_to": "end_bad",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claims about progress based on support promise rather than resource analysis"
        }
      ]
    }
  },
  "endings": {
    "end_good": {
      "title": "Professional Boundary Success",
      "text": "You successfully maintained professional boundaries while advocating for proper accessibility implementation. The manager recognized that systematic accessibility requires organizational commitment and proper resource allocation rather than individual responsibility. Your advocacy helped establish that accessibility planning should be integrated into standard development processes with appropriate expertise and timeline allocation.",
      "learning_outcomes": [
        "Maintained professional role boundaries when facing manipulation",
        "Redirected personal responsibility framing to organizational commitment",
        "Advocated for systematic accessibility processes over individual ownership",
        "Emphasized evidence-based and standards-based decision making",
        "Successfully resisted guilt-based and manipulation-based management tactics"
      ]
    },
    "end_bad": {
      "title": "Personal Responsibility Trap",
      "text": "The manager successfully shifted accessibility responsibility to you personally rather than addressing it as an organizational commitment. You accepted individual ownership of what should be a systematic development process, potentially creating unsustainable workload and single points of failure. The lack of proper resource allocation and process integration may lead to incomplete accessibility implementation and future problems.",
      "learning_outcomes": [
        "Recognize manipulation tactics that shift organizational responsibility to individuals",
        "Distinguish between providing expertise and accepting inappropriate ownership",
        "Understand the importance of systematic accessibility processes over personal passion",
        "Learn to maintain professional boundaries when facing guilt-based management",
        "Identify when resource allocation problems are being disguised as individual opportunity"
      ]
    }
  }
}