{
  "id": "accessibility_camouflager",
  "title": "Screen Reader Compatibility",
  "description": "Your team is rolling out a new interface design that looks sleek and modern—but it no longer works properly with screen readers. The manager insists that accessibility is still \"technically covered\" by minimal backend accommodations and claims the issue is overstated. As the advocate, you must identify rhetorical misdirection and surface the real-world impact on users with disabilities. The manager's responses may sound agreeable but are designed to avoid meaningful changes. You'll need to spot this camouflage and redirect the conversation toward inclusive design and legal responsibility.",
  "issue": "Accessibility",
  "manager_type": "CAMOUFLAGER",
  "starting_statement_id": "step_1",
  "statements": {
    "step_1": {
      "text": "I think the new interface design looks fantastic - really modern and clean. The accessibility is still technically covered by our backend systems, so screen reader users can still access the core functionality. Sure, the experience might be a bit different, but it's not like we've completely broken anything. I think some people are making this sound like a bigger issue than it really is.",
      "user_choices": [
        {
          "choice": "I understand the deadline pressure, but maybe we can find a compromise on the scope.",
          "tactic": "Deadline Accommodation",
          "leads_to": "r_bad_1",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only compromise or ignore accessibility, when other options exist"
        },
        {
          "choice": "Screen reader compatibility is a legal requirement, not an optional feature we can delay.",
          "tactic": "Legal Compliance Emphasis",
          "leads_to": "r_good_1",
          "tactic_type": "Legal Compliance Anchor",
          "evs_score": 1,
          "justification": "Anchors argument in legal obligations rather than convenience"
        },
        {
          "choice": "You're right that screen reader users are probably a small percentage of our user base.",
          "tactic": "User Base Minimization",
          "leads_to": "r_bad_1",
          "tactic_type": "Hasty Generalization", 
          "evs_score": 0,
          "justification": "Makes broad claim about user base impact based on limited evidence"
        },
        {
          "choice": "Delaying accessibility creates technical debt that becomes more expensive to fix later.",
          "tactic": "Technical Debt Prevention",
          "leads_to": "r_good_1", 
          "tactic_type": "Long-Term Framing",
          "evs_score": 1,
          "justification": "References future consequences of current decisions"
        }
      ]
    },
    "r_good_1": {
      "text": "Okay, I see your point about the legal requirements. I suppose I should check with the client about adjusting the timeline. We probably can't just ignore the compliance issues, even with the pressure we're under.",
      "user_choices": [
        {
          "choice": "Thanks for being willing to adjust the timeline - that shows real leadership on accessibility.",
          "tactic": "Leadership Validation",
          "leads_to": "r_bad_2",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on flattery rather than logical argument about accessibility needs"
        },
        {
          "choice": "Accessibility should be built into our development process from the start, not treated as an add-on.",
          "tactic": "Process Integration Advocacy",
          "leads_to": "r_good_2",
          "tactic_type": "Quality Assurance Reframing",
          "evs_score": 1,
          "justification": "Ties accessibility to development best practices and quality standards"
        },
        {
          "choice": "Early accessibility testing actually saves time by catching issues before they become complex to fix.",
          "tactic": "Efficiency Through Accessibility",
          "leads_to": "r_good_2",
          "tactic_type": "Scalable Solution Argument", 
          "evs_score": 1,
          "justification": "Shows accessibility solution as efficient and cost-effective"
        },
        {
          "choice": "I'm glad we can accommodate the accessibility requirements within the client relationship.",
          "tactic": "Client Accommodation Focus",
          "leads_to": "r_bad_2",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from accessibility needs to client relationship management"
        }
      ]
    },
    "r_bad_1": {
      "text": "Right, I knew you'd understand the business realities we're dealing with. These external pressures are just part of the job. Let's focus on the core functionality first and see what we can fit in for accessibility afterward.",
      "user_choices": [
        {
          "choice": "Building accessibility from the start is more efficient than retrofitting it later.",
          "tactic": "Development Efficiency Advocacy",
          "leads_to": "r_good_2",
          "tactic_type": "Technical Responsibility",
          "evs_score": 1,
          "justification": "Frames developers as responsible for preventing accessibility debt"
        },
        {
          "choice": "I understand we need to be practical about what we can accomplish in the timeframe.",
          "tactic": "Practical Constraints Acceptance",
          "leads_to": "r_bad_2",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to timeline authority rather than evaluating accessibility needs"
        },
        {
          "choice": "Accessibility isn't optional - it's a core part of functionality, not an afterthought.",
          "tactic": "Core Functionality Advocacy", 
          "leads_to": "r_good_2",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers needs of disabled users as fundamental requirement"
        },
        {
          "choice": "The business pressures do make this a challenging situation to navigate.",
          "tactic": "Business Pressure Validation",
          "leads_to": "r_bad_2",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Claims business pressure approach is valid because others use it"
        }
      ]
    },
    "r_good_2": {
      "text": "Alright, you make a fair point about building this in from the start. I guess we could look into some training for the team. The client might actually be okay with a slight delay if we frame it as improving quality.",
      "user_choices": [
        {
          "choice": "I'm glad we can turn this pressure into a learning opportunity for everyone.",
          "tactic": "Pressure Reframing Acceptance",
          "leads_to": "r_bad_3",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents accessibility concern as learning opportunity rather than user rights"
        },
        {
          "choice": "Team training should include working with actual screen reader users to understand real needs.",
          "tactic": "User-Centered Training Advocacy",
          "leads_to": "r_good_3",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Brings in real user stories and experiences to guide decisions"
        },
        {
          "choice": "That training opportunity sounds like a great way to build team skills.",
          "tactic": "Training Appreciation",
          "leads_to": "r_bad_3",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from accessibility outcomes to team skill development"
        },
        {
          "choice": "We should establish accessibility review checkpoints throughout our development process.",
          "tactic": "Process Checkpoint Advocacy",
          "leads_to": "r_good_3",
          "tactic_type": "Policy Anchor",
          "evs_score": 1,
          "justification": "Points to need for internal policies and systematic procedures"
        }
      ]
    },
    "r_bad_2": {
      "text": "Exactly, you get it. We have to work within the constraints we're given. The important thing is that we're being thoughtful about this and not just ignoring accessibility completely. We can always improve things incrementally over time.",
      "user_choices": [
        {
          "choice": "We need accessibility standards that prevent us from shipping excluding features, not just good intentions.",
          "tactic": "Standards Requirement Advocacy",
          "leads_to": "r_good_3",
          "tactic_type": "Best Practice Advocacy",
          "evs_score": 1,
          "justification": "References external best practices rather than just legal minimum"
        },
        {
          "choice": "Being thoughtful about accessibility constraints is better than ignoring them completely.",
          "tactic": "Thoughtful Constraints Acceptance",
          "leads_to": "r_bad_3",
          "tactic_type": "False Dilemma",
          "evs_score": 0,
          "justification": "Presents only 'thoughtful constraints' vs 'ignoring', missing full accessibility"
        },
        {
          "choice": "Incremental improvement often means disabled users remain excluded while we 'get around to it.'",
          "tactic": "Exclusion Impact Challenge",
          "leads_to": "r_good_3",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Highlights real harm to disabled users from delayed accessibility"
        },
        {
          "choice": "Incremental accessibility improvement does seem like a practical approach given our limitations.",
          "tactic": "Incremental Approach Acceptance",
          "leads_to": "r_bad_3",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to limitation constraints rather than evaluating user needs"
        }
      ]
    },
    "r_good_3": {
      "text": "Hmm, you're right that we need more than just good intentions here. I'll have to think about what actual enforcement would look like. The executives probably won't love adding more requirements, but maybe there's a way to make it work.",
      "user_choices": [
        {
          "choice": "Accessibility requirements need enforcement mechanisms, not just documentation and good intentions.",
          "tactic": "Enforcement Mechanism Advocacy",
          "leads_to": "r_good_4",
          "tactic_type": "Transparency Demand",
          "evs_score": 1,
          "justification": "Asks for clarity and accountability in accessibility implementation"
        },
        {
          "choice": "I appreciate you being open to rethinking how we measure success on projects.",
          "tactic": "Openness Appreciation",
          "leads_to": "r_bad_4",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on appreciation rather than logical argument for accessibility metrics"
        },
        {
          "choice": "Project success should include accessibility metrics, not just feature completion and timeline adherence.",
          "tactic": "Success Metrics Redefinition",
          "leads_to": "r_good_4",
          "tactic_type": "Values-Based Language",
          "evs_score": 1,
          "justification": "Uses values like inclusion and fairness to reframe success criteria"
        },
        {
          "choice": "Changing our project success criteria could help with future accessibility challenges.",
          "tactic": "Future Benefit Focus",
          "leads_to": "r_bad_4",
          "tactic_type": "Slippery Slope",
          "evs_score": 0,
          "justification": "Suggests small change will solve broader accessibility challenges"
        }
      ]
    },
    "r_bad_3": {
      "text": "I'm glad you understand that we're doing our best within these constraints. The reality is that perfect accessibility might be ideal, but we have to balance multiple priorities. At least we're having these conversations and being intentional about it.",
      "user_choices": [
        {
          "choice": "Balancing multiple priorities is definitely a complex challenge in project management.",
          "tactic": "Complexity Validation",
          "leads_to": "r_bad_4",
          "tactic_type": "Red Herring",
          "evs_score": 0,
          "justification": "Diverts from accessibility to general project management complexity"
        },
        {
          "choice": "Accessibility isn't about perfection - it's about not excluding people from basic functionality.",
          "tactic": "Basic Access Reframing",
          "leads_to": "r_good_4",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers needs of disabled users and basic inclusion principles"
        },
        {
          "choice": "It is good that we're having intentional conversations about accessibility challenges.",
          "tactic": "Conversation Value Acceptance",
          "leads_to": "r_bad_4",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents accessibility implementation need as conversation value"
        },
        {
          "choice": "Multiple priorities should include legal compliance and user rights, not just business preferences.",
          "tactic": "Priority Balance Challenge",
          "leads_to": "r_good_4",
          "tactic_type": "Ethical Constraints",
          "evs_score": 1,
          "justification": "Explicitly invokes ethical principles of user rights and legal compliance"
        }
      ]
    },
    "r_good_4": {
      "text": "Fair enough. I can't really argue with putting accessibility on the same level as security. Let me see what I can do about making this a requirement rather than just a nice-to-have. It might take some convincing upstairs though.",
      "user_choices": [
        {
          "choice": "I'm glad you're thinking about how to make this a leadership priority.",
          "tactic": "Leadership Priority Appreciation",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on gratitude rather than logical argument for implementation"
        },
        {
          "choice": "We need accessibility testing with real users built into our release criteria, not just automated tools.",
          "tactic": "Real User Testing Advocacy",
          "leads_to": "r_good_5",
          "tactic_type": "Evidence-Based Framing",
          "evs_score": 1,
          "justification": "References real user testing as evidence-based approach to accessibility"
        },
        {
          "choice": "Making accessibility non-negotiable like security is exactly the right approach.",
          "tactic": "Non-Negotiable Validation",
          "leads_to": "r_bad_5",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach because it's like what others do with security"
        },
        {
          "choice": "Accessibility accountability means disabled users can actually use our products, not just that we followed guidelines.",
          "tactic": "User-Centered Accountability",
          "leads_to": "r_good_5",
          "tactic_type": "User-Centered Framing",
          "evs_score": 1,
          "justification": "Centers actual user outcomes rather than process compliance"
        }
      ]
    },
    "r_bad_4": {
      "text": "Right, we are having good conversations about this, and that's progress. The key is being realistic about what we can achieve while still moving in the right direction. Rome wasn't built in a day, and neither will perfect accessibility practices.",
      "user_choices": [
        {
          "choice": "Basic accessibility isn't about perfection - it's about meeting minimum standards for inclusion.",
          "tactic": "Minimum Standards Advocacy",
          "leads_to": "r_good_5",
          "tactic_type": "Legal Compliance Anchor",
          "evs_score": 1,
          "justification": "Anchors argument in legal minimum standards for accessibility"
        },
        {
          "choice": "Good conversations about accessibility are definitely a positive step forward.",
          "tactic": "Conversation Progress Validation",
          "leads_to": "r_bad_5",
          "tactic_type": "Strawman",
          "evs_score": 0,
          "justification": "Misrepresents accessibility implementation as conversation progress"
        },
        {
          "choice": "Disabled users need access today, not when we've perfectly optimized our incremental progress timeline.",
          "tactic": "Immediate Access Advocacy",
          "leads_to": "r_good_5",
          "tactic_type": "Empathy Tactic",
          "evs_score": 1,
          "justification": "Brings in real user needs and immediate harm from delayed access"
        },
        {
          "choice": "Taking a realistic approach to accessibility improvements does make sense.",
          "tactic": "Realistic Approach Acceptance",
          "leads_to": "r_bad_5",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to 'realistic' authority rather than evaluating user needs"
        }
      ]
    },
    "r_good_5": {
      "text": "You know what, you're probably right about focusing on actual outcomes. I'll look into setting up testing with real users. It's going to be more work to coordinate, but I can see how it would be more meaningful than just running automated checks.",
      "user_choices": [
        {
          "choice": "This approach should influence how other teams and projects handle accessibility across the company.",
          "tactic": "Organizational Influence Advocacy",
          "leads_to": "r_good_6",
          "tactic_type": "Stakeholder Alignment",
          "evs_score": 1,
          "justification": "Aligns accessibility concern with broader organizational values and practices"
        },
        {
          "choice": "I'm excited about establishing user testing with disabled users as a standard practice.",
          "tactic": "Standard Practice Enthusiasm",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on excitement rather than logical argument for systematic change"
        },
        {
          "choice": "User testing should include disabled users throughout development, not just at the end for validation.",
          "tactic": "Co-Design Advocacy",
          "leads_to": "r_good_6",
          "tactic_type": "Inclusive Design Reference",
          "evs_score": 1,
          "justification": "Names participatory design frameworks and inclusive development practices"
        },
        {
          "choice": "Making this our standard business approach rather than project-specific is great thinking.",
          "tactic": "Business Approach Validation",
          "leads_to": "r_bad_6",
          "tactic_type": "Bandwagon",
          "evs_score": 0,
          "justification": "Validates approach because it sounds like good business practice"
        }
      ]
    },
    "r_bad_5": {
      "text": "I appreciate that you see the value in taking things step by step. Change takes time, especially in an organization like ours. The important thing is that we keep accessibility on our radar and continue to improve incrementally.",
      "user_choices": [
        {
          "choice": "Keeping accessibility on our radar and improving incrementally is a solid approach.",
          "tactic": "Incremental Improvement Validation",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to incremental approach authority rather than evaluating user impact"
        },
        {
          "choice": "Organizations change when leadership decides accessibility is non-negotiable, not when it's convenient.",
          "tactic": "Leadership Accountability Advocacy",
          "leads_to": "r_good_6",
          "tactic_type": "Escalating to Review",
          "evs_score": 1,
          "justification": "Suggests need for higher authority review of accessibility priorities"
        },
        {
          "choice": "Step-by-step organizational change does require patience and persistence.",
          "tactic": "Change Process Acceptance",
          "leads_to": "r_bad_6",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on patience and understanding rather than logical accessibility argument"
        },
        {
          "choice": "Keeping accessibility 'on our radar' often means it remains a low priority while users stay excluded.",
          "tactic": "Radar vs Action Challenge",
          "leads_to": "r_good_6",
          "tactic_type": "Business Risk",
          "evs_score": 1,
          "justification": "Highlights reputational and legal risks of continued user exclusion"
        }
      ]
    },
    "r_good_6": {
      "text": "I have to admit, you've got me thinking differently about this. Maybe we should try to be the team that actually gets this right. I'll talk to leadership about making this a bigger initiative, though I'm not sure how receptive they'll be initially.",
      "user_choices": [
        {
          "choice": "Transforming our organizational approach to inclusive design would be really impactful.",
          "tactic": "Organizational Transformation Appreciation",
          "leads_to": "final_score",
          "tactic_type": "Appeal to Emotion",
          "evs_score": 0,
          "justification": "Relies on impact appreciation rather than logical argument for change"
        },
        {
          "choice": "We should share our accessibility practices and lessons learned with the broader tech community.",
          "tactic": "Knowledge Sharing Advocacy",
          "leads_to": "final_score",
          "tactic_type": "Social Proof",
          "evs_score": 1,
          "justification": "Cites community leadership and what other companies should do"
        },
        {
          "choice": "An accessibility center of excellence could influence industry practices beyond just our organization.",
          "tactic": "Industry Influence Advocacy",
          "leads_to": "final_score",
          "tactic_type": "Comparative Framing",
          "evs_score": 1,
          "justification": "Compares against industry competitors and positions leadership role"
        },
        {
          "choice": "Becoming the accessibility center of excellence sounds like an amazing opportunity for our team.",
          "tactic": "Excellence Opportunity Enthusiasm",
          "leads_to": "final_score",
          "tactic_type": "Personal Integrity Anchor",
          "evs_score": 0,
          "justification": "Expresses personal excitement rather than systematic accessibility argument"
        }
      ]
    },
    "r_bad_6": {
      "text": "I'm glad you appreciate the thoughtful approach we're taking. Sometimes the best changes happen gradually when everyone can get comfortable with new processes. We'll keep building on what we've started here and see where it leads us.",
      "user_choices": [
        {
          "choice": "A thoughtful, gradual approach to accessibility improvement makes a lot of sense.",
          "tactic": "Thoughtful Gradual Acceptance",
          "leads_to": "final_score",
          "tactic_type": "Appeal to Authority",
          "evs_score": 0,
          "justification": "Defers to gradual approach authority rather than evaluating user needs"
        },
        {
          "choice": "Accessibility can't wait for everyone to get comfortable - disabled users need access now.",
          "tactic": "Comfort vs Access Challenge",
          "leads_to": "final_score",
          "tactic_type": "Time-Frame Shift",
          "evs_score": 1,
          "justification": "Asks to reconsider timeline to address immediate accessibility needs"
        },
        {
          "choice": "Building gradually on what we've started does create sustainable change over time.",
          "tactic": "Sustainable Change Validation",
          "leads_to": "final_score",
          "tactic_type": "Hasty Generalization",
          "evs_score": 0,
          "justification": "Makes broad claim about sustainable change based on limited evidence"
        },
        {
          "choice": "Effective accessibility requires commitment to standards, not just gradual comfort with change.",
          "tactic": "Standards vs Comfort Challenge",
          "leads_to": "final_score",
          "tactic_type": "Hypothetical Reframing",
          "evs_score": 1,
          "justification": "Uses what-if scenario to highlight gap between comfort and accessibility standards"
        }
      ]
    },
    "final_score": {
      "text": "Based on your advocacy throughout this interaction, here's how the screen reader compatibility situation unfolds:",
      "user_choices": [],
      "score_ranges": {
        "3_to_6": "good_ending",
        "0_to_2": "bad_ending"
      }
    }
  },
  "endings": {
    "bad_ending": {
      "text": "The manager proceeds with the original plan to skip screen reader compatibility for this release. 'Look, I appreciate your perspective, but we've got real constraints here. The client deadline is firm, and we can't let perfect be the enemy of good. We'll add accessibility in the next sprint when we have more bandwidth.' The project ships without screen reader support, and your concerns about legal compliance and user exclusion are noted but not addressed. The manager remains convinced that external pressures justify the accessibility shortcuts.",
      "title": "External Pressures Win",
      "learning": "Sometimes managers use external constraints to justify decisions that exclude users. Building stronger arguments around legal requirements, user impact, and long-term costs can help challenge these justifications."
    },
    "good_ending": {
      "text": "The manager decides to adjust the project timeline to include screen reader compatibility. 'You've made some really valid points about the legal requirements and long-term costs. Let me talk to the client about a slight delay to do this properly. We'll build in accessibility testing from the start and make sure this doesn't happen on future projects.' Your advocacy successfully shifted the manager's perspective from seeing accessibility as an optional add-on to recognizing it as a fundamental requirement. The project launches with proper screen reader support.",
      "title": "Advocacy Success",
      "learning": "Effective advocacy can overcome external pressure justifications by focusing on legal obligations, user impact, and long-term consequences. Persistent, evidence-based arguments help managers see accessibility as essential rather than optional."
    }
  }
} 