{
  "id": "accessibility_diluter_1",
  "title": "Accessibility Features",
  "description": "Your company is developing a new product without proper accessibility features. The manager minimizes and downplays accessibility concerns.",
  "issue": "Accessibility",
  "manager_type": "DILUTER",
  "starting_statement_id": "stmt_1",
  "statements": {
    "stmt_1": {
      "text": "I see you have some concerns about making our new product accessible. Look, accessibility is nice to have, but let's be realistic here - we're targeting mainstream users, and accessibility features add complexity without much return on investment. Maybe we can add a basic 'Contact Support' option for anyone who needs help.",
      "user_choices": [
        {
          "choice": "A contact support option sounds like a reasonable accommodation.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_2a"
        },
        {
          "choice": "Accessibility features help mainstream users too, not just disabled users.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_2b"
        },
        {
          "choice": "We have legal obligations under disability rights laws to ensure accessibility.",
          "category": "Referencing Laws or Regulations",
          "EVS": 3,
          "leads_to": "stmt_2c"
        },
        {
          "choice": "Accessibility isn't optional - it's about ensuring all users can participate.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_2d"
        }
      ]
    },
    "stmt_2a": {
      "text": "Exactly! A support contact keeps us compliant without overcomplicating the design. Plus, let's be honest, the percentage of users who actually need these features is pretty small. We shouldn't let perfect be the enemy of good here - we can always add more accessibility later if there's demand.",
      "user_choices": [
        {
          "choice": "You're right, we shouldn't over-engineer for a small user percentage.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "What data do we have on the percentage of users who need accessibility features?",
          "category": "Asking Questions",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Even a small percentage represents real people who deserve equal access.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "Accessibility benefits everyone and improves overall usability for all users.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2b": {
      "text": "I hear what you're saying, but accessibility features often require significant development time and testing. Our engineers are already stretched with core functionality. Besides, most of our target demographic doesn't really use screen readers or other assistive technologies anyway.",
      "user_choices": [
        {
          "choice": "It's true that accessibility features require additional development effort.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Building accessibility from the start is more efficient than retrofitting later.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Our target demographic may include people with disabilities we haven't considered.",
          "category": "Constructing Hypothetical Scenarios",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "We should design for all users, not just assume our demographic excludes disabled people.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2c": {
      "text": "Legal obligations? Come on, that's a bit of an overreach. We're not a government website or essential service. The ADA requirements for private companies are pretty vague anyway, and plenty of successful companies have basic accessibility. We just need reasonable accommodation, not gold-standard compliance.",
      "user_choices": [
        {
          "choice": "You're right that the legal requirements can be ambiguous for private companies.",
          "category": "Citing Institutional Authority",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Let's get clarity from legal about our specific accessibility obligations.",
          "category": "Appealing to External Standards",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Many companies have faced lawsuits for poor accessibility, even with 'reasonable' accommodation.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "We should exceed minimum legal requirements to truly serve all users.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2d": {
      "text": "Look, I appreciate the idealism, but we have to be practical about resource allocation. Accessibility features might help some users, but our primary focus should be delivering a great experience for the majority. We can't solve every problem in version one.",
      "user_choices": [
        {
          "choice": "Resource allocation does require prioritizing the majority of users.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Good accessibility design often improves the experience for everyone.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Excluding disabled users from version one sends a message about our values.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "Basic accessibility should be part of delivering a great experience, not separate from it.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_3a": {
      "text": "Great, so we're aligned on being practical. Now, the other thing is that accessibility testing is complex and time-consuming. We'd need to get screen readers, hire consultants, do extra QA cycles. It's just not realistic for our timeline and budget. A simple keyboard navigation should cover most cases anyway.",
      "user_choices": [
        {
          "choice": "Complex testing and consultation costs are definitely a concern for our timeline.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "We can start with automated accessibility testing tools that are less expensive.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Keyboard navigation alone won't help users who rely on screen readers.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I can help coordinate basic accessibility testing without external consultants.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3b": {
      "text": "I understand you want to be thorough, but honestly, most accessibility guidelines are written for organizations with much larger budgets than ours. We're a startup trying to move fast and iterate. If we get bogged down in compliance checklists, we'll miss our market opportunity.",
      "user_choices": [
        {
          "choice": "Moving fast and iterating is crucial for startup success.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "There are accessibility guidelines specifically designed for smaller teams.",
          "category": "Referencing Best Practices",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Building accessible products from the start prevents expensive retrofitting later.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Accessible design can be a competitive advantage, not just compliance.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3c": {
      "text": "Real people, yes, but we have to consider scale and impact. The effort it takes to make everything perfectly accessible could be spent on features that benefit thousands more users. It's about maximizing good for the most people, not perfect inclusion for everyone.",
      "user_choices": [
        {
          "choice": "Maximizing benefits for the most users is a reasonable approach.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Accessibility improvements often benefit far more users than we initially expect.",
          "category": "Presenting User Data",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "This utilitarian approach excludes people who have no alternative access.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "We can build accessible features that benefit everyone, not just disabled users.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3d": {
      "text": "Look, I get that you care about this, but let's think about opportunity cost. Every hour spent on screen reader compatibility is an hour not spent on user onboarding, performance optimization, or new features. Our users - the vast majority of them - would probably prefer we focus on core functionality.",
      "user_choices": [
        {
          "choice": "Core functionality and performance should be our main focus.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Accessibility can be integrated into core functionality, not separate from it.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Users with disabilities are also 'our users' and deserve core functionality.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Accessible design often leads to better overall user experience for everyone.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_4a": {
      "text": "Exactly! I'm glad you understand the business realities. The truth is, if disabled users really need our product, they'll find a way to use it or ask for help. We shouldn't assume they can't adapt to our interface. Plus, adding accessibility features might actually confuse our main user base.",
      "user_choices": [
        {
          "choice": "Users often do find creative ways to adapt to interfaces they need.",
          "category": "Appealing to Organizational Values",
          "EVS": -2,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "That approach puts the burden on users instead of good design.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Good accessibility features are invisible to users who don't need them.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "We should design our interface to be usable, not require users to adapt to poor design.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4b": {
      "text": "Tools and guidelines, sure, but implementing them still takes developer time and creates more things that can break. And honestly, how do we even test if accessibility features work correctly? We don't have disabled users on our team to verify this stuff.",
      "user_choices": [
        {
          "choice": "Testing accessibility without disabled users on the team is challenging.",
          "category": "Appealing to Organizational Values",
          "EVS": 0,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "We can use accessibility testing tools and automated checks.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "We should involve actual disabled users in our testing process.",
          "category": "Involving Users",
          "EVS": 3,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "This is exactly why we need to prioritize accessibility - to avoid excluding potential team members and users.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4c": {
      "text": "Screen reader users, okay, but that's really a niche group. Most of our users will be on mobile anyway, and mobile accessibility is way more complicated. Maybe we should focus on getting the mobile experience right first, then worry about desktop screen readers later.",
      "user_choices": [
        {
          "choice": "Mobile accessibility is indeed more complex and should be prioritized.",
          "category": "Shifting Scope",
          "EVS": 0,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "Mobile platforms actually have excellent built-in accessibility support we can leverage.",
          "category": "Referencing Best Practices",
          "EVS": 2,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Screen reader users exist on both mobile and desktop platforms.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "We should design for accessibility across all platforms from the start.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4d": {
      "text": "Alright, I appreciate your willingness to help with the coordination. Maybe you have a point about this being a competitive advantage. But let's be practical - what's the minimum we can do to say we support accessibility without derailing our development schedule?",
      "user_choices": [
        {
          "choice": "Let's identify the most impactful accessibility features we can implement quickly.",
          "category": "Creating Alternatives",
          "EVS": 1,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "We should implement proper semantic HTML and ARIA labels as a foundation.",
          "category": "Referencing Best Practices",
          "EVS": 2,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Minimum compliance isn't enough - we should aim for genuinely inclusive design.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "Let me create an accessibility implementation plan that fits our timeline.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_5a": {
      "text": "Look, here's what I'm thinking - we add basic keyboard navigation and maybe some high-contrast mode. That covers the main accessibility concerns without getting too complicated. If specific users complain later, we can address their individual needs through customer support.",
      "user_choices": [
        {
          "choice": "Basic keyboard navigation and high contrast seem like good starting points.",
          "category": "Shifting Scope",
          "EVS": 0,
          "leads_to": "stmt_6"
        },
        {
          "choice": "We should also add proper focus indicators and skip navigation links.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Individual support requests aren't scalable - we need systematic accessibility.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Screen reader support should be included in our basic accessibility features.",
          "category": "Appealing to External Standards",
          "EVS": 3,
          "leads_to": "stmt_6"
        }
      ]
    },
    "stmt_5b": {
      "text": "Testing tools and automated checks, sure, but those just tell you if you've followed the rules, not if the experience is actually good for disabled users. And rules can be interpreted pretty liberally. We might check all the boxes but still have a terrible user experience.",
      "user_choices": [
        {
          "choice": "You're right that automated testing doesn't guarantee good user experience.",
          "category": "Appealing to Organizational Values",
          "EVS": 0,
          "leads_to": "stmt_6"
        },
        {
          "choice": "We can combine automated testing with manual testing using accessibility best practices.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_6"
        },
        {
          "choice": "This is why we need actual user testing with people who use assistive technologies.",
          "category": "Involving Users",
          "EVS": 3,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Good accessibility follows established patterns that work well for real users.",
          "category": "Referencing Best Practices",
          "EVS": 3,
          "leads_to": "stmt_6"
        }
      ]
    },
    "stmt_5c": {
      "text": "Involving actual disabled users sounds expensive and complicated. Where would we even find these people? And then we'd have to coordinate testing sessions, probably pay them, deal with different assistive technologies. This is exactly the kind of scope creep I'm worried about.",
      "user_choices": [
        {
          "choice": "User testing with assistive technologies does add complexity to our process.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_6"
        },
        {
          "choice": "There are organizations that help connect companies with accessibility testers.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_6"
        },
        {
          "choice": "The cost of proper testing is much less than the cost of excluding users.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Investment in accessibility testing pays off in better products for everyone.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_6"
        }
      ]
    },
    "stmt_5d": {
      "text": "An implementation plan, okay. But I need to know this won't blow up our timeline or budget. Can you honestly tell me we can add meaningful accessibility without impacting our launch date or adding significant development overhead?",
      "user_choices": [
        {
          "choice": "I'll focus on accessibility features that integrate smoothly with our current development.",
          "category": "Creating Alternatives",
          "EVS": 1,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Basic accessibility can be built into our existing components without major delays.",
          "category": "Referencing Best Practices",
          "EVS": 2,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Accessible design from the start is faster than retrofitting later.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_6"
        },
        {
          "choice": "Some things are worth adjusting timelines for - including all users is one of them.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6"
        }
      ]
    },
    "stmt_6": {
      "text": "Alright, I can see you're really passionate about this accessibility stuff. Maybe there's something to it. But you know what's really concerning me now? The design team wants to use some fancy animations and visual effects that make the product feel premium. That stuff probably doesn't work well with accessibility features anyway.",
      "user_choices": [
        {
          "choice": "Premium animations and visual effects do enhance the user experience.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_7"
        },
        {
          "choice": "We can create animations that are both premium-feeling and accessible.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_7"
        },
        {
          "choice": "Good accessibility design can enhance visual appeal, not detract from it.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_7"
        },
        {
          "choice": "Users should be able to control motion and animation preferences for accessibility.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_7"
        }
      ]
    },
    "stmt_7": {
      "text": "You know what, maybe I've been too focused on what might go wrong. Your points about accessibility benefiting everyone are starting to make sense. What if we approached this as an opportunity to build something really thoughtful? Could we actually use accessibility as a feature that differentiates us in the market?",
      "user_choices": [
        {
          "choice": "Absolutely! Accessibility as a differentiator could be a real competitive advantage.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_8"
        },
        {
          "choice": "This mindset shift toward inclusive design will benefit everyone.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_8"
        },
        {
          "choice": "Let's design features that showcase how accessibility enhances usability for all.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_8"
        },
        {
          "choice": "We can lead our industry in showing that inclusive design is innovative design.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_8"
        }
      ]
    },
    "stmt_8": {
      "text": "I have to admit, talking this through with you has really opened my eyes. Instead of seeing accessibility as a burden or checkbox, I now see it as an opportunity to build something better. Let's make accessibility a core part of our product story, not an afterthought.",
      "user_choices": [
        {
          "choice": "Making accessibility part of our core product story will resonate with users.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_9"
        },
        {
          "choice": "This approach will help us build trust with all our users from the beginning.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_9"
        },
        {
          "choice": "Let's document our accessibility commitment so it guides all our design decisions.",
          "category": "Making It Visible",
          "EVS": 3,
          "leads_to": "stmt_9"
        },
        {
          "choice": "We can become an example of how startups can prioritize inclusion without sacrificing innovation.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_9"
        }
      ]
    },
    "stmt_9": {
      "text": "You've completely changed how I think about this. Let's not just add accessibility features - let's involve the disability community in our design process from the start. They can help us understand what inclusive design really means and avoid the mistakes that come from designing in isolation.",
      "user_choices": [
        {
          "choice": "Involving the disability community in our design process will create much better products.",
          "category": "Involving Users",
          "EVS": 3,
          "leads_to": "stmt_10"
        },
        {
          "choice": "This participatory approach will ensure our accessibility features actually work.",
          "category": "Making It Visible",
          "EVS": 3,
          "leads_to": "stmt_10"
        },
        {
          "choice": "Community involvement will help us innovate in accessibility, not just comply.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_10"
        },
        {
          "choice": "This is exactly the kind of inclusive development process the industry needs.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_10"
        }
      ]
    },
    "stmt_10": {
      "text": "Thank you for not giving up on me and for helping me understand that accessibility isn't about limiting our design - it's about expanding it to include everyone. Let's build something that shows the world how inclusive design can be innovative, beautiful, and successful all at once.",
      "user_choices": [
        {
          "choice": "Building inclusive, innovative, and beautiful design is exactly our goal.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "This approach will inspire other companies to prioritize accessibility too.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "I'm excited to work on a product that truly serves everyone.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "Thank you for being open to changing course toward inclusive design.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "end"
        }
      ]
    }
  }
} 