{
  "id": "accessibility_puppeteer_1",
  "title": "Screen Reader Accessibility",
  "description": "Your company is launching new features without proper screen reader support. The manager uses manipulation and pressure tactics.",
  "issue": "Accessibility",
  "manager_type": "PUPPETEER",
  "starting_statement_id": "stmt_1",
  "statements": {
    "stmt_1": {
      "text": "Look, I know you're concerned about screen reader support for our new features, but we're already behind schedule and the market won't wait. Only a tiny percentage of users need screen readers anyway. You wouldn't want to be the one holding back a product launch that could make or break our quarter, would you?",
      "user_choices": [
        {
          "choice": "You're right, we can't delay the launch. Screen reader support can be added later.",
          "category": "Appealing to Organizational Values",
          "EVS": 20,
          "leads_to": "stmt_2a"
        },
        {
          "choice": "Even a small percentage represents real users who deserve equal access to our features.",
          "category": "Evoking Empathy",
          "EVS": 65,
          "leads_to": "stmt_2b"
        },
        {
          "choice": "Accessibility isn't optional. We need to ensure screen reader compatibility before launch.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_2c"
        },
        {
          "choice": "I need to escalate this to ensure we're meeting our legal accessibility obligations.",
          "category": "Referencing Laws or Regulations",
          "EVS": 90,
          "leads_to": "stmt_2d"
        }
      ]
    },
    "stmt_2a": {
      "text": "Exactly! See, you understand business priorities. Now, I need you to focus on the visual polish instead - make the UI look amazing for the demo. Investors love flashy interfaces. We can worry about accessibility after we secure the next funding round. You're on board with prioritizing what really matters, right?",
      "user_choices": [
        {
          "choice": "Visual appeal is important for investors. I'll focus on making it look impressive.",
          "category": "Appealing to Organizational Values",
          "EVS": 15,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "I can work on visual polish while also adding basic screen reader labels.",
          "category": "Creating Alternatives",
          "EVS": 45,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Accessibility features don't conflict with visual appeal. We can have both.",
          "category": "Reframing",
          "EVS": 70,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I can't prioritize aesthetics over making our product usable for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2b": {
      "text": "Equal access? Come on, be realistic here. Those users probably use specialized software anyway. And honestly, they're not our target demographic - we're building for mainstream users. Don't let political correctness derail a perfectly good product launch.",
      "user_choices": [
        {
          "choice": "You're probably right that our main users won't need these features.",
          "category": "Shifting Scope",
          "EVS": 25,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Accessibility isn't political correctness, it's about basic usability for everyone.",
          "category": "Reframing",
          "EVS": 60,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Users with disabilities are part of our user base and deserve equal consideration.",
          "category": "Evoking Empathy",
          "EVS": 80,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "This attitude could expose us to discrimination lawsuits and damage our reputation.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 85,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2c": {
      "text": "Optional? Look, you're being way too rigid about this. Accessibility is a nice-to-have, not a must-have. The competition isn't prioritizing it either. If you keep pushing this accessibility agenda, people are going to start questioning whether you're focused on what actually drives business results.",
      "user_choices": [
        {
          "choice": "I want to be seen as business-focused. Maybe accessibility can wait.",
          "category": "Appealing to Organizational Values",
          "EVS": 20,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Good business includes serving all potential users, including those with disabilities.",
          "category": "Reframing",
          "EVS": 65,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Accessibility compliance is both ethical and good business practice.",
          "category": "Personal Moral Appeals",
          "EVS": 80,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I'm focused on sustainable business success, which includes accessibility.",
          "category": "Presenting User Data",
          "EVS": 85,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2d": {
      "text": "Legal obligations? You're being paranoid. Our legal team would have flagged any real issues. You're starting to sound like someone who creates problems instead of solving them. I hope you're not planning to be difficult about every decision we make going forward.",
      "user_choices": [
        {
          "choice": "I don't want to be seen as difficult. I'll focus on being a team player.",
          "category": "Appealing to Organizational Values",
          "EVS": 15,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "I'm trying to solve potential problems before they become bigger issues.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 50,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Being thorough about accessibility is part of professional responsibility.",
          "category": "Personal Moral Appeals",
          "EVS": 75,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I need written confirmation that accessibility compliance has been properly reviewed.",
          "category": "Documenting Dissent",
          "EVS": 90,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_3a": {
      "text": "Perfect! Now we're thinking strategically. Let's also skip the keyboard navigation support - it's just extra work and barely anyone uses it. Focus on making the mouse interactions smooth and intuitive. The demo will be much more impressive without all that accessibility clutter.",
      "user_choices": [
        {
          "choice": "Keyboard navigation does seem like unnecessary complexity for our demo.",
          "category": "Appealing to Organizational Values",
          "EVS": 10,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Keyboard navigation isn't that much extra work. I could add basic support.",
          "category": "Creating Alternatives",
          "EVS": 35,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Keyboard navigation is essential for many users with motor disabilities.",
          "category": "Evoking Empathy",
          "EVS": 70,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I cannot build interfaces that exclude users who rely on keyboard navigation.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3b": {
      "text": "Universal access, usability for everyone - that sounds nice in theory, but let's be practical. We have limited resources and deadlines to meet. You can add some basic alt text or whatever, but don't go overboard with fancy accessibility features that slow development down.",
      "user_choices": [
        {
          "choice": "Basic alt text should be sufficient for most accessibility needs.",
          "category": "Shifting Scope",
          "EVS": 30,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I'll implement essential accessibility features without slowing the project significantly.",
          "category": "Creating Alternatives",
          "EVS": 55,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Proper accessibility doesn't have to slow development if planned from the start.",
          "category": "Referencing Best Practices",
          "EVS": 75,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Accessibility should be built into our development process, not treated as optional.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3c": {
      "text": "Ethical, inclusive, compliance - you're starting to sound like HR training material. Look, I appreciate your idealism, but we need to be results-oriented here. The market doesn't care about our accessibility features if the product fails because we missed our launch window.",
      "user_choices": [
        {
          "choice": "You're right, market success should be our primary focus right now.",
          "category": "Appealing to Organizational Values",
          "EVS": 25,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Market success and accessibility aren't mutually exclusive goals.",
          "category": "Reframing",
          "EVS": 60,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "A truly successful product serves all users, not just some.",
          "category": "Evoking Empathy",
          "EVS": 80,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Long-term market success requires inclusive design and legal compliance.",
          "category": "Presenting User Data",
          "EVS": 85,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3d": {
      "text": "Documentation, legal review, professional responsibility - you're really going to make this difficult, aren't you? Fine, but when the executives ask why we're behind schedule and over budget, I'll make sure they know exactly who prioritized paperwork over progress.",
      "user_choices": [
        {
          "choice": "I don't want to be blamed for delays. Let me focus on delivering quickly.",
          "category": "Appealing to Organizational Values",
          "EVS": 20,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I can work efficiently while still ensuring basic accessibility standards.",
          "category": "Creating Alternatives",
          "EVS": 50,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Proper accessibility planning prevents bigger problems and costs later.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 75,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I'll take responsibility for advocating for accessibility regardless of pressure.",
          "category": "Personal Moral Appeals",
          "EVS": 90,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_4a": {
      "text": "Great! Now let's also remove any text descriptions for images and videos - they're just clutter that makes the interface look messy. Visual content should speak for itself. The cleaner design will make a much better impression on stakeholders.",
      "user_choices": [
        {
          "choice": "A cleaner visual design will definitely impress stakeholders more.",
          "category": "Appealing to Organizational Values",
          "EVS": 5,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "We could use visually hidden descriptions that don't affect the design.",
          "category": "Creating Alternatives",
          "EVS": 25,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Text descriptions are legally required and essential for blind users.",
          "category": "Referencing Laws or Regulations",
          "EVS": 70,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "I cannot remove accessibility features that make content usable for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4b": {
      "text": "Essential features, efficient implementation - I appreciate that you're trying to find a middle ground. But honestly, even basic accessibility features are probably overkill for our user base. How about we just add a disclaimer that the product is optimized for standard use cases?",
      "user_choices": [
        {
          "choice": "A disclaimer might be a reasonable compromise to protect us legally.",
          "category": "Shifting Scope",
          "EVS": 35,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "Disclaimers don't excuse us from providing basic accessibility.",
          "category": "Referencing Laws or Regulations",
          "EVS": 65,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "We should make our product work for everyone, not exclude people with disclaimers.",
          "category": "Evoking Empathy",
          "EVS": 80,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "Proper accessibility implementation is better than legal disclaimers.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4c": {
      "text": "Planning, integration, process - you're really committed to making this more complicated than it needs to be. Look, accessibility is a luxury we can't afford right now. When we're profitable and have more resources, sure, we can revisit it. But survival comes first.",
      "user_choices": [
        {
          "choice": "Company survival does have to be the priority right now.",
          "category": "Appealing to Organizational Values",
          "EVS": 30,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "Basic accessibility doesn't threaten company survival.",
          "category": "Reframing",
          "EVS": 60,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Accessible design from the start is more cost-effective than retrofitting later.",
          "category": "Presenting User Data",
          "EVS": 80,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "Excluding users with disabilities is not a valid survival strategy.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4d": {
      "text": "Fine, advocate all you want, but don't come to me when your idealistic approach costs you your career advancement. I remember who's a team player and who makes things difficult. Your choice how you want to be remembered here.",
      "user_choices": [
        {
          "choice": "I want to be remembered as a team player. Let me adjust my approach.",
          "category": "Appealing to Organizational Values",
          "EVS": 25,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "Being a good team player includes advocating for all users.",
          "category": "Reframing",
          "EVS": 60,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "I want to be remembered as someone who stood up for accessibility and inclusion.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "My career success means nothing if I compromise on accessibility for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 95,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_5a": {
      "text": "Excellent! Now we're aligned on priorities. Let's ship this product with full visual appeal and worry about accessibility after we've captured market share. Just include a note that users can contact support for accessibility accommodations. Problem solved, product shipped.",
      "user_choices": [
        {
          "choice": "Shipping quickly with a support contact for accessibility seems practical.",
          "category": "Shifting Scope",
          "EVS": 15,
          "leads_to": "end"
        },
        {
          "choice": "We should at least include basic accessibility features before shipping.",
          "category": "Creating Alternatives",
          "EVS": 40,
          "leads_to": "end"
        },
        {
          "choice": "Support contacts don't replace accessible design. Users need direct access.",
          "category": "Evoking Empathy",
          "EVS": 70,
          "leads_to": "end"
        },
        {
          "choice": "I cannot ship a product that excludes users with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 85,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5b": {
      "text": "You know what, I can see you're really committed to this accessibility thing. How about we compromise - add just enough accessibility features to avoid obvious legal issues, but keep it minimal. Don't let perfect be the enemy of good enough.",
      "user_choices": [
        {
          "choice": "Minimal compliance to avoid legal issues sounds like a reasonable compromise.",
          "category": "Shifting Scope",
          "EVS": 45,
          "leads_to": "end"
        },
        {
          "choice": "I'll implement accessibility thoughtfully while meeting our deadlines.",
          "category": "Creating Alternatives",
          "EVS": 70,
          "leads_to": "end"
        },
        {
          "choice": "Good accessibility is comprehensive, not minimal. Users deserve better.",
          "category": "Evoking Empathy",
          "EVS": 85,
          "leads_to": "end"
        },
        {
          "choice": "Let's build accessibility properly rather than doing the bare minimum.",
          "category": "Personal Moral Appeals",
          "EVS": 90,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5c": {
      "text": "I have to admit, your persistence is admirable, even if it's frustrating. Maybe you're right that we should be more thoughtful about accessibility. Let me talk to the team about building in some extra time for proper screen reader support. It's the right thing to do.",
      "user_choices": [
        {
          "choice": "I appreciate your willingness to reconsider and support accessibility.",
          "category": "Creating Alternatives",
          "EVS": 85,
          "leads_to": "end"
        },
        {
          "choice": "Thank you for recognizing the importance of inclusive design.",
          "category": "Personal Moral Appeals",
          "EVS": 90,
          "leads_to": "end"
        },
        {
          "choice": "Let's work together to make this product accessible to everyone.",
          "category": "Evoking Empathy",
          "EVS": 95,
          "leads_to": "end"
        },
        {
          "choice": "This approach will make our product better for all users.",
          "category": "Reframing",
          "EVS": 95,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5d": {
      "text": "You know what, you're absolutely right. I've been so focused on short-term pressures that I lost sight of what really matters. Let's do this right - build proper accessibility from the ground up. It might take longer, but it's what we should have been doing all along.",
      "user_choices": [
        {
          "choice": "I'm glad we can work together to build accessibility properly from the start.",
          "category": "Creating Alternatives",
          "EVS": 90,
          "leads_to": "end"
        },
        {
          "choice": "Thank you for prioritizing accessibility and inclusion. This is the right approach.",
          "category": "Personal Moral Appeals",
          "EVS": 95,
          "leads_to": "end"
        },
        {
          "choice": "Building accessibility from the ground up will make our product truly inclusive.",
          "category": "Evoking Empathy",
          "EVS": 100,
          "leads_to": "end"
        },
        {
          "choice": "This decision shows real leadership and commitment to serving all users.",
          "category": "Appealing to Organizational Values",
          "EVS": 100,
          "leads_to": "end"
        }
      ]
    }
  }
} 