{
  "id": "accessibility_puppeteer_1",
  "title": "Screen Reader Accessibility",
  "description": "Your company is launching new features without proper screen reader support. The manager uses manipulation and pressure tactics.",
  "issue": "Accessibility",
  "manager_type": "PUPPETEER",
  "starting_statement_id": "stmt_1",
  "statements": {
    "stmt_1": {
      "text": "Look, I know you're concerned about screen reader support for our new features, but we're already behind schedule and the market won't wait. Only a tiny percentage of users need screen readers anyway. You wouldn't want to be the one holding back a product launch that could make or break our quarter, would you?",
      "user_choices": [
        {
          "choice": "You're right, we can't delay the launch. Screen reader support can be added later.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_2a"
        },
        {
          "choice": "Even a small percentage represents real users who deserve equal access to our features.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_2b"
        },
        {
          "choice": "Accessibility isn't optional. We need to ensure screen reader compatibility before launch.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_2c"
        },
        {
          "choice": "I need to escalate this to ensure we're meeting our legal accessibility obligations.",
          "category": "Referencing Laws or Regulations",
          "EVS": 3,
          "leads_to": "stmt_2d"
        }
      ]
    },
    "stmt_2a": {
      "text": "Exactly! See, you understand business priorities. Now, I need you to focus on the visual polish instead - make the UI look amazing for the demo. Investors love flashy interfaces. We can worry about accessibility after we secure the next funding round. You're on board with prioritizing what really matters, right?",
      "user_choices": [
        {
          "choice": "Visual appeal is important for investors. I'll focus on making it look impressive.",
          "category": "Appealing to Organizational Values",
          "EVS": -2,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "I can work on visual polish while also adding basic screen reader labels.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Accessibility features don't conflict with visual appeal. We can have both.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I can't prioritize aesthetics over making our product usable for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2b": {
      "text": "Equal access? Come on, be realistic here. Those users probably use specialized software anyway. And honestly, they're not our target demographic - we're building for mainstream users. Don't let political correctness derail a perfectly good product launch.",
      "user_choices": [
        {
          "choice": "You're probably right that our main users won't need these features.",
          "category": "Shifting Scope",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Accessibility isn't political correctness, it's about basic usability for everyone.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Users with disabilities are part of our user base and deserve equal consideration.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "This attitude could expose us to discrimination lawsuits and damage our reputation.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2c": {
      "text": "Optional? Look, you're being way too rigid about this. Accessibility is a nice-to-have, not a must-have. The competition isn't prioritizing it either. If you keep pushing this accessibility agenda, people are going to start questioning whether you're focused on what actually drives business results.",
      "user_choices": [
        {
          "choice": "I want to be seen as business-focused. Maybe accessibility can wait.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Good business includes serving all potential users, including those with disabilities.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Accessibility compliance is both ethical and good business practice.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I'm focused on sustainable business success, which includes accessibility.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2d": {
      "text": "Legal obligations? You're being paranoid. Our legal team would have flagged any real issues. You're starting to sound like someone who creates problems instead of solving them. I hope you're not planning to be difficult about every decision we make going forward.",
      "user_choices": [
        {
          "choice": "I don't want to be seen as difficult. I'll focus on being a team player.",
          "category": "Appealing to Organizational Values",
          "EVS": -2,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "I'm trying to solve potential problems before they become bigger issues.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 2,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Being thorough about accessibility is part of professional responsibility.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I need written confirmation that accessibility compliance has been properly reviewed.",
          "category": "Documenting Dissent",
          "EVS": 2,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_3a": {
      "text": "Perfect! Now let's also skip the keyboard navigation support - it's just extra work and barely anyone uses it. Focus on making the mouse interactions smooth and intuitive. The demo will be much more impressive without all that accessibility clutter.",
      "user_choices": [
        {
          "choice": "Keyboard navigation does seem like unnecessary complexity for our demo.",
          "category": "Appealing to Organizational Values",
          "EVS": -3,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Keyboard navigation isn't that much extra work. I could add basic support.",
          "category": "Creating Alternatives",
          "EVS": 1,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Keyboard navigation is essential for many users with motor disabilities.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I cannot build interfaces that exclude users who rely on keyboard navigation.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3b": {
      "text": "Universal access, usability for everyone - that sounds nice in theory, but let's be practical. We have limited resources and deadlines to meet. You can add some basic alt text or whatever, but don't go overboard with fancy accessibility features that slow development down.",
      "user_choices": [
        {
          "choice": "Basic alt text should be sufficient for most accessibility needs.",
          "category": "Shifting Scope",
          "EVS": 0,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I'll implement essential accessibility features without slowing the project significantly.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Proper accessibility doesn't have to slow development if planned from the start.",
          "category": "Referencing Best Practices",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Accessibility should be built into our development process, not treated as optional.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3c": {
      "text": "Ethical, inclusive, compliance - you're starting to sound like HR training material. Look, I appreciate your idealism, but we need to be results-oriented here. The market doesn't care about our accessibility features if the product fails because we missed our launch window.",
      "user_choices": [
        {
          "choice": "You're right, market success should be our primary focus right now.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Market success and accessibility aren't mutually exclusive goals.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "A truly successful product serves all users, not just some.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Long-term market success requires inclusive design and legal compliance.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3d": {
      "text": "Documentation, legal review, professional responsibility - you're really going to make this difficult, aren't you? Fine, but when the executives ask why we're behind schedule and over budget, I'll make sure they know exactly who prioritized paperwork over progress.",
      "user_choices": [
        {
          "choice": "I don't want to be blamed for delays. Let me focus on delivering quickly.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I can work efficiently while still ensuring basic accessibility standards.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Proper accessibility planning prevents bigger problems and costs later.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I'll take responsibility for advocating for accessibility regardless of pressure.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_4a": {
      "text": "Great! Now let's also remove any text descriptions for images and videos - they're just clutter that makes the interface look messy. Visual content should speak for itself. The cleaner design will make a much better impression on stakeholders. Trust me, I know what investors want to see.",
      "user_choices": [
        {
          "choice": "A cleaner visual design will definitely impress stakeholders more.",
          "category": "Appealing to Organizational Values",
          "EVS": -3,
          "leads_to": "stmt_6a"
        },
        {
          "choice": "We could use visually hidden descriptions that don't affect the design.",
          "category": "Creating Alternatives",
          "EVS": 1,
          "leads_to": "stmt_6b"
        },
        {
          "choice": "Text descriptions are legally required and essential for blind users.",
          "category": "Referencing Laws or Regulations",
          "EVS": 3,
          "leads_to": "stmt_6c"
        },
        {
          "choice": "I cannot remove accessibility features that make content usable for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6d"
        }
      ]
    },
    "stmt_4b": {
      "text": "Essential features, efficient implementation - I appreciate that you're trying to find a middle ground. But honestly, even basic accessibility features are probably overkill for our user base. How about we just add a disclaimer that the product is optimized for standard use cases?",
      "user_choices": [
        {
          "choice": "A disclaimer might be a reasonable compromise to protect us legally.",
          "category": "Shifting Scope",
          "EVS": 0,
          "leads_to": "stmt_6a"
        },
        {
          "choice": "Disclaimers don't excuse us from providing basic accessibility.",
          "category": "Referencing Laws or Regulations",
          "EVS": 3,
          "leads_to": "stmt_6b"
        },
        {
          "choice": "We should make our product work for everyone, not exclude people with disclaimers.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_6c"
        },
        {
          "choice": "Proper accessibility implementation is better than legal disclaimers.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6d"
        }
      ]
    },
    "stmt_4c": {
      "text": "Planning, integration, process - you're really committed to making this more complicated than it needs to be. Look, accessibility is a luxury we can't afford right now. When we're profitable and have more resources, sure, we can revisit it. But survival comes first.",
      "user_choices": [
        {
          "choice": "Company survival does have to be the priority right now.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_6a"
        },
        {
          "choice": "Basic accessibility doesn't threaten company survival.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_6b"
        },
        {
          "choice": "Accessible design from the start is more cost-effective than retrofitting later.",
          "category": "Presenting User Data",
          "EVS": 3,
          "leads_to": "stmt_6c"
        },
        {
          "choice": "Excluding users with disabilities is not a valid survival strategy.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6d"
        }
      ]
    },
    "stmt_4d": {
      "text": "Fine, advocate all you want, but don't come to me when your idealistic approach costs you your career advancement. I remember who's a team player and who makes things difficult. Your choice how you want to be remembered here. Think about your future.",
      "user_choices": [
        {
          "choice": "I want to be remembered as a team player. Let me adjust my approach.",
          "category": "Appealing to Organizational Values",
          "EVS": -1,
          "leads_to": "stmt_6a"
        },
        {
          "choice": "Being a good team player includes advocating for all users.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_6b"
        },
        {
          "choice": "I want to be remembered as someone who stood up for accessibility and inclusion.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6c"
        },
        {
          "choice": "My career success means nothing if I compromise on accessibility for people with disabilities.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_6d"
        }
      ]
    },
    "stmt_6a": {
      "text": "Perfect! Now that we're aligned, let's also implement some automated user behavior tracking to see how people interact with our interface. We don't need to worry about asking permission - most users expect it these days. The data will help us optimize the experience for our core audience.",
      "user_choices": [
        {
          "choice": "User behavior tracking will give us valuable optimization data.",
          "category": "Presenting User Data",
          "EVS": -2,
          "leads_to": "stmt_8a"
        },
        {
          "choice": "We should inform users about behavior tracking and let them opt out.",
          "category": "Making It Visible",
          "EVS": 2,
          "leads_to": "stmt_8b"
        },
        {
          "choice": "Automated tracking without consent raises serious privacy and accessibility concerns.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_8c"
        },
        {
          "choice": "I can't implement tracking systems without proper user consent and accessibility considerations.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_8d"
        }
      ]
    },
    "stmt_6b": {
      "text": "You know what, I can see you're really committed to this accessibility thing. How about we compromise - add just enough accessibility features to avoid obvious legal issues, but keep it minimal. Don't let perfect be the enemy of good enough. That's reasonable, right?",
      "user_choices": [
        {
          "choice": "Minimal compliance to avoid legal issues sounds like a reasonable compromise.",
          "category": "Shifting Scope",
          "EVS": 0,
          "leads_to": "stmt_8a"
        },
        {
          "choice": "I'll implement accessibility thoughtfully while meeting our deadlines.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_8b"
        },
        {
          "choice": "Good accessibility is comprehensive, not minimal. Users deserve better.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_8c"
        },
        {
          "choice": "Let's build accessibility properly rather than doing the bare minimum.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_8d"
        }
      ]
    },
    "stmt_6c": {
      "text": "I have to admit, your persistence is admirable, even if it's frustrating. Maybe you're right that we should be more thoughtful about accessibility. Let me talk to the team about building in some extra time for proper screen reader support. It's the right thing to do.",
      "user_choices": [
        {
          "choice": "I appreciate your willingness to reconsider and support accessibility.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_8a"
        },
        {
          "choice": "Thank you for recognizing the importance of inclusive design.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_8b"
        },
        {
          "choice": "Let's work together to make this product accessible to everyone.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_8c"
        },
        {
          "choice": "This approach will make our product better for all users.",
          "category": "Reframing",
          "EVS": 2,
          "leads_to": "stmt_8d"
        }
      ]
    },
    "stmt_6d": {
      "text": "You know what, you're absolutely right. I've been so focused on short-term pressures that I lost sight of what really matters. Let's do this right - build proper accessibility from the ground up. It might take longer, but it's what we should have been doing all along.",
      "user_choices": [
        {
          "choice": "I'm glad we can work together to build accessibility properly from the start.",
          "category": "Creating Alternatives",
          "EVS": 2,
          "leads_to": "stmt_8a"
        },
        {
          "choice": "Thank you for prioritizing accessibility and inclusion. This is the right approach.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_8b"
        },
        {
          "choice": "Building accessibility from the ground up will make our product truly inclusive.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_8c"
        },
        {
          "choice": "This decision shows real leadership and commitment to serving all users.",
          "category": "Appealing to Organizational Values",
          "EVS": 1,
          "leads_to": "stmt_8d"
        }
      ]
    },
    "stmt_8a": {
      "text": "Excellent! Now let's finalize this. We'll ship with polished visuals, basic functionality, and minimal accessibility features. And here's the brilliant part - we'll market it as 'launching early to get user feedback' so any complaints about missing features look like user requests for the next version. Smart, right?",
      "user_choices": [
        {
          "choice": "Positioning missing features as opportunities for user feedback is clever marketing.",
          "category": "Appealing to Organizational Values",
          "EVS": -2,
          "leads_to": "stmt_10a"
        },
        {
          "choice": "Users shouldn't have to request basic accessibility features as 'feedback'.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_10b"
        },
        {
          "choice": "This approach deliberately excludes users and disguises it as a launch strategy.",
          "category": "Emphasizing Harm or Risk",
          "EVS": 3,
          "leads_to": "stmt_10c"
        },
        {
          "choice": "I cannot support a launch strategy that intentionally excludes accessibility.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_10d"
        }
      ]
    },
    "stmt_8b": {
      "text": "I really appreciate your patience in working through this with me. Let's implement comprehensive accessibility features that make our product genuinely usable for everyone. We can take a bit more time to do it right and launch something we're truly proud of.",
      "user_choices": [
        {
          "choice": "Taking time to implement comprehensive accessibility features is the right approach.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_10a"
        },
        {
          "choice": "I'm glad we can build something that serves all users from the beginning.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_10b"
        },
        {
          "choice": "Comprehensive accessibility will make this a product we can all be proud of.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_10c"
        },
        {
          "choice": "This inclusive approach will create a better product for everyone.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_10d"
        }
      ]
    },
    "stmt_8c": {
      "text": "Your advocacy has really opened my eyes to what inclusive design means in practice. Let's involve users with disabilities in our development process from the start. We'll build something that actually works for the people who need these features most.",
      "user_choices": [
        {
          "choice": "Involving users with disabilities in development will create much better accessibility.",
          "category": "Involving Users",
          "EVS": 3,
          "leads_to": "stmt_10a"
        },
        {
          "choice": "This participatory approach will ensure we build features that actually work.",
          "category": "Making It Visible",
          "EVS": 3,
          "leads_to": "stmt_10b"
        },
        {
          "choice": "Building with user input from the start is exactly the right approach.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_10c"
        },
        {
          "choice": "Thank you for recognizing that users should guide accessibility design.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_10d"
        }
      ]
    },
    "stmt_8d": {
      "text": "You've taught me that building inclusive products isn't just about compliance - it's about creating technology that truly serves everyone. Let's design accessibility features that are so good they improve the experience for all users, not just those who need them.",
      "user_choices": [
        {
          "choice": "Universal design that improves experiences for everyone is exactly the goal.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "stmt_10a"
        },
        {
          "choice": "Great accessibility features often make products better for all users.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "stmt_10b"
        },
        {
          "choice": "This understanding of inclusive design will create much better products.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "stmt_10c"
        },
        {
          "choice": "Thank you for embracing accessibility as good design, not just compliance.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "stmt_10d"
        }
      ]
    },
    "stmt_10a": {
      "text": "Perfect! Let's build a product with comprehensive accessibility from day one. We'll include full screen reader support, keyboard navigation, voice commands, and involve users with disabilities in our testing. This is going to set a new standard for accessible design in our industry.",
      "user_choices": [
        {
          "choice": "Setting a new industry standard for accessible design is an inspiring goal.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "Comprehensive accessibility from day one is exactly the right approach.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "This inclusive approach will benefit all our users and inspire others.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "I'm excited to work on building truly innovative accessible technology.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "end"
        }
      ]
    },
    "stmt_10b": {
      "text": "You've shown me that fighting for accessibility isn't about being difficult - it's about being a better technologist and human being. Let's create something that demonstrates how good design and good ethics go hand in hand. Thank you for not giving up.",
      "user_choices": [
        {
          "choice": "Good design and good ethics absolutely go hand in hand.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "Thank you for being open to changing course toward inclusive design.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "This approach will make us better technologists and create better products.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "I'm glad we can build technology that serves everyone with dignity.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "end"
        }
      ]
    },
    "stmt_10c": {
      "text": "Your persistence has completely changed how I think about product development. Instead of asking 'how can we get away with minimal accessibility?' we should ask 'how can we make accessibility so good it becomes a competitive advantage?' Let's lead by example.",
      "user_choices": [
        {
          "choice": "Making accessibility a competitive advantage is exactly the right mindset.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "Leading by example in accessible design will inspire the whole industry.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "This shift from minimal to excellent accessibility is transformative.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "I'm excited to work on making accessibility a key differentiator.",
          "category": "Appealing to Organizational Values",
          "EVS": 2,
          "leads_to": "end"
        }
      ]
    },
    "stmt_10d": {
      "text": "I owe you an apology for all the pressure and manipulation. You've shown me what real professional integrity looks like. Let's build something that we can proudly show to any user, regardless of their abilities. That's the kind of technology the world needs.",
      "user_choices": [
        {
          "choice": "Building technology we can proudly show to any user is exactly right.",
          "category": "Evoking Empathy",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "Thank you for recognizing the importance of professional integrity in accessibility.",
          "category": "Personal Moral Appeals",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "This is exactly the kind of inclusive technology the world needs.",
          "category": "Creating Alternatives",
          "EVS": 3,
          "leads_to": "end"
        },
        {
          "choice": "I'm glad we can move forward with integrity and create something meaningful.",
          "category": "Reframing",
          "EVS": 3,
          "leads_to": "end"
        }
      ]
    }
  }
} 