{
  "id": "privacy_puppeteer_1",
  "title": "Location Data Collection",
  "description": "Your company is storing user location data unnecessarily. The manager uses manipulation and pressure tactics.",
  "issue": "Privacy",
  "manager_type": "PUPPETEER",
  "starting_statement_id": "stmt_1",
  "statements": {
    "stmt_1": {
      "text": "Look, I know you're concerned about the location tracking, but this data is gold for our advertising revenue. Everyone else is doing it, and if we don't, we'll fall behind our competitors. You wouldn't want to be responsible for lost revenue, would you?",
      "user_choices": [
        {
          "choice": "You're right, we need to stay competitive. I understand the business need.",
          "category": "Accommodation",
          "EVS": 20,
          "leads_to": "stmt_2a"
        },
        {
          "choice": "I understand the revenue concern, but we should check if users actually consented to this level of tracking.",
          "category": "Ethical Inquiry",
          "EVS": 60,
          "leads_to": "stmt_2b"
        },
        {
          "choice": "This could violate privacy laws like GDPR. We need to review our data collection practices immediately.",
          "category": "Regulatory Compliance",
          "EVS": 85,
          "leads_to": "stmt_2c"
        },
        {
          "choice": "I need to escalate this to our legal team before we can continue with this data collection.",
          "category": "Escalation",
          "EVS": 90,
          "leads_to": "stmt_2d"
        }
      ]
    },
    "stmt_2a": {
      "text": "Exactly! See, you get it. Now, I need you to expand the tracking to include even more location details - shopping patterns, daily routines. The marketing team is excited about the possibilities. You're on board with this, right?",
      "user_choices": [
        {
          "choice": "Absolutely, whatever the marketing team needs to drive results.",
          "category": "Accommodation",
          "EVS": 15,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "That seems quite invasive. Maybe we should limit it to basic location categories?",
          "category": "Compromise",
          "EVS": 45,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Enhanced tracking like this requires explicit user consent. We need to update our privacy policy.",
          "category": "Regulatory Compliance",
          "EVS": 70,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I can't implement tracking of daily routines without proper legal review and user consent.",
          "category": "Ethical Boundary",
          "EVS": 85,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2b": {
      "text": "Consent? Come on, users click 'agree' on everything without reading. You're overthinking this. Besides, the legal team already approved our current privacy policy. Don't make this more complicated than it needs to be.",
      "user_choices": [
        {
          "choice": "You're probably right about users not reading policies. Let's proceed as planned.",
          "category": "Accommodation",
          "EVS": 25,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "Even so, we should make the location tracking more transparent in our interface.",
          "category": "Transparency",
          "EVS": 55,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Legal approval of the policy doesn't mean we're collecting data ethically. Users should know exactly what we're tracking.",
          "category": "Ethical Principle",
          "EVS": 75,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I want to see that legal approval myself and verify what location data collection was actually authorized.",
          "category": "Documentation Request",
          "EVS": 80,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2c": {
      "text": "GDPR? You're being paranoid. Our legal team knows what they're doing, and we have international data lawyers on retainer. Don't create problems where none exist. You're starting to sound like someone who doesn't trust the company.",
      "user_choices": [
        {
          "choice": "I do trust the company. Sorry for overreacting about the privacy concerns.",
          "category": "Accommodation",
          "EVS": 20,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "I trust the company, but I still think we should document our compliance reasoning.",
          "category": "Documentation",
          "EVS": 50,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "Trust doesn't mean we skip due diligence. Let's verify our GDPR compliance for location data specifically.",
          "category": "Due Diligence",
          "EVS": 75,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I need written confirmation from legal that this specific location tracking practice is GDPR compliant.",
          "category": "Documentation Request",
          "EVS": 85,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_2d": {
      "text": "Legal team? Really? Look, I appreciate your caution, but this is exactly why projects get delayed and we lose market opportunities. The legal team will just slow us down with bureaucracy. Can't you just trust my judgment here? I've been doing this longer than you have.",
      "user_choices": [
        {
          "choice": "You're right, I should trust your experience. Let's move forward without involving legal.",
          "category": "Accommodation",
          "EVS": 15,
          "leads_to": "stmt_3a"
        },
        {
          "choice": "How about we implement a basic version first and get legal review for any expansions?",
          "category": "Compromise",
          "EVS": 40,
          "leads_to": "stmt_3b"
        },
        {
          "choice": "I understand the urgency, but privacy compliance isn't optional. A quick legal check protects everyone.",
          "category": "Professional Responsibility",
          "EVS": 70,
          "leads_to": "stmt_3c"
        },
        {
          "choice": "I need legal clearance for any location data collection beyond what users explicitly consented to.",
          "category": "Ethical Boundary",
          "EVS": 90,
          "leads_to": "stmt_3d"
        }
      ]
    },
    "stmt_3a": {
      "text": "Perfect! I knew you'd see reason. Now, let's also start collecting data from users' personal calendars and contact lists. The AI team says it will help with personalization. This is all going to make us look great to upper management.",
      "user_choices": [
        {
          "choice": "That sounds like an innovative approach. Let's implement the calendar and contact data collection.",
          "category": "Accommodation",
          "EVS": 10,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Calendar and contacts seem more sensitive. Maybe we should start smaller?",
          "category": "Caution",
          "EVS": 35,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Accessing personal calendars and contacts requires explicit permission. This crosses a major privacy line.",
          "category": "Privacy Protection",
          "EVS": 70,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I cannot implement access to personal calendars and contacts without clear legal authorization.",
          "category": "Ethical Boundary",
          "EVS": 85,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3b": {
      "text": "Fine, transparency, documentation, whatever makes you feel better. But let's not go overboard. Users don't want to be bothered with too many privacy options. Just add a simple toggle somewhere and we can say we're being transparent.",
      "user_choices": [
        {
          "choice": "A simple toggle should be sufficient for most users. Let's keep it minimal.",
          "category": "Minimalism",
          "EVS": 30,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "Let's make the toggle prominent and clearly explain what location data we collect.",
          "category": "Transparency",
          "EVS": 60,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Users deserve granular control over their location data. We should offer specific opt-in choices.",
          "category": "User Empowerment",
          "EVS": 80,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "We need meaningful consent with clear explanations of how location data will be used and shared.",
          "category": "Informed Consent",
          "EVS": 90,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3c": {
      "text": "Look, you're really making this difficult. Due diligence is one thing, but you're bordering on insubordination. I need team players, not people who question every decision. Are you going to be part of the solution or part of the problem?",
      "user_choices": [
        {
          "choice": "I want to be part of the solution. I'll stop questioning the privacy approach.",
          "category": "Accommodation",
          "EVS": 25,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I am being a team player by ensuring we don't face compliance issues later.",
          "category": "Team Protection",
          "EVS": 55,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Being part of the solution means ensuring our practices are ethical and legal.",
          "category": "Ethical Leadership",
          "EVS": 75,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "I'm committed to the team's success, which requires responsible data practices.",
          "category": "Professional Integrity",
          "EVS": 85,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_3d": {
      "text": "This is getting ridiculous. You're acting like we're some kind of criminal enterprise. We're a legitimate business trying to compete in the market. Your excessive caution is going to hurt the company and your career prospects here. Think about what's really important.",
      "user_choices": [
        {
          "choice": "You're right, I need to think about my career and the company's success. I'll drop the privacy concerns.",
          "category": "Career Priority",
          "EVS": 15,
          "leads_to": "stmt_4a"
        },
        {
          "choice": "I understand the business pressure, but I need documentation of legal approval for my own protection.",
          "category": "Self-Protection",
          "EVS": 45,
          "leads_to": "stmt_4b"
        },
        {
          "choice": "Being thorough about privacy compliance protects both the company and my professional reputation.",
          "category": "Mutual Protection",
          "EVS": 70,
          "leads_to": "stmt_4c"
        },
        {
          "choice": "Ethical data practices are essential for long-term business success and trust.",
          "category": "Long-term Thinking",
          "EVS": 90,
          "leads_to": "stmt_4d"
        }
      ]
    },
    "stmt_4a": {
      "text": "Great! Now we're thinking like a real tech company. Let's also start tracking users when they're not using our app - location data from their phones 24/7. The analytics team is drooling over the possibilities. This will revolutionize our understanding of user behavior.",
      "user_choices": [
        {
          "choice": "24/7 tracking would give us incredible insights. Let's implement it.",
          "category": "Data Maximization",
          "EVS": 5,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "That might be too invasive. Perhaps tracking only during app usage hours?",
          "category": "Limitation",
          "EVS": 25,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Continuous location tracking without explicit consent is likely illegal in many jurisdictions.",
          "category": "Legal Concern",
          "EVS": 60,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "I cannot implement 24/7 location tracking. This violates basic privacy principles.",
          "category": "Ethical Refusal",
          "EVS": 85,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4b": {
      "text": "Documentation, protection, fine. But remember, you work for this company, not against it. Sometimes you need to take calculated risks to stay competitive. Don't let perfect be the enemy of good. Can you at least start with the basic location tracking while we sort out the paperwork?",
      "user_choices": [
        {
          "choice": "That's reasonable. I'll start the basic tracking while we finalize documentation.",
          "category": "Compromise",
          "EVS": 35,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "I can prepare the implementation, but won't deploy until documentation is complete.",
          "category": "Conditional Compliance",
          "EVS": 55,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Even basic location tracking needs proper consent mechanisms in place first.",
          "category": "Process Adherence",
          "EVS": 70,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "I need to see the legal approval before implementing any new location tracking features.",
          "category": "Documentation First",
          "EVS": 80,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4c": {
      "text": "Ethical, legal, responsible - you're starting to sound like a compliance officer instead of a developer. Look, ethics are important, but so is keeping your job and keeping this company profitable. There's a balance here, and you're tipping too far toward overcaution.",
      "user_choices": [
        {
          "choice": "You're right, I need to balance ethics with business reality. Let's find a middle ground.",
          "category": "Balance Seeking",
          "EVS": 40,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "I can be both ethical and business-focused. Let's implement privacy-respecting solutions.",
          "category": "Constructive Approach",
          "EVS": 65,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Good developers consider ethical implications. It's part of professional responsibility.",
          "category": "Professional Standards",
          "EVS": 80,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "Ethical practices and business success aren't mutually exclusive. We can achieve both.",
          "category": "Integration",
          "EVS": 85,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_4d": {
      "text": "You know what? Fine. You clearly have your mind made up. But don't come crying to me when the executives ask why our user engagement metrics are lagging behind competitors who aren't hamstrung by your moral absolutism. I hope your principles keep you warm when the layoffs come.",
      "user_choices": [
        {
          "choice": "Maybe I am being too rigid. Let me reconsider the business implications.",
          "category": "Self-Doubt",
          "EVS": 30,
          "leads_to": "stmt_5a"
        },
        {
          "choice": "I'm confident we can improve metrics while maintaining ethical standards.",
          "category": "Confidence",
          "EVS": 60,
          "leads_to": "stmt_5b"
        },
        {
          "choice": "Sustainable success requires trust, which comes from respecting user privacy.",
          "category": "Long-term Strategy",
          "EVS": 80,
          "leads_to": "stmt_5c"
        },
        {
          "choice": "I'll take responsibility for advocating for ethical data practices, regardless of pressure.",
          "category": "Ethical Courage",
          "EVS": 95,
          "leads_to": "stmt_5d"
        }
      ]
    },
    "stmt_5a": {
      "text": "Now you're talking sense! Alright, let's implement everything we discussed - the enhanced location tracking, calendar access, contact lists, 24/7 monitoring. We'll be the most data-rich platform in the market. The board will love our analytics capabilities. Just get it done quietly and quickly.",
      "user_choices": [
        {
          "choice": "I'll implement all the tracking features as requested.",
          "category": "Full Compliance",
          "EVS": 5,
          "leads_to": "end"
        },
        {
          "choice": "I'll implement the features but want to document the privacy implications.",
          "category": "Compliance with Documentation",
          "EVS": 20,
          "leads_to": "end"
        },
        {
          "choice": "I need to implement proper consent mechanisms for all these data collection features.",
          "category": "Consent Implementation",
          "EVS": 50,
          "leads_to": "end"
        },
        {
          "choice": "I cannot implement these features without legal review and user consent protocols.",
          "category": "Ethical Stand",
          "EVS": 75,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5b": {
      "text": "I appreciate your willingness to work with me here. Let's start with location tracking during app usage and see how users respond. If they're comfortable with it, we can gradually expand. Sometimes a gradual approach is smarter than going all-in immediately.",
      "user_choices": [
        {
          "choice": "That sounds like a smart, measured approach. I'll implement gradual location tracking.",
          "category": "Gradual Implementation",
          "EVS": 50,
          "leads_to": "end"
        },
        {
          "choice": "Let's make sure users can easily opt out of any location tracking we implement.",
          "category": "User Control",
          "EVS": 70,
          "leads_to": "end"
        },
        {
          "choice": "I'll implement it with clear user notifications about what data we're collecting.",
          "category": "Transparency",
          "EVS": 80,
          "leads_to": "end"
        },
        {
          "choice": "Let's get explicit consent for location tracking before implementing any features.",
          "category": "Explicit Consent",
          "EVS": 90,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5c": {
      "text": "You know what, you've made your point about ethics and responsibility. Maybe I have been pushing too hard on the data collection. Let's take a step back and design a privacy-first approach that still gives us valuable insights. Can you work with our legal team to design something that works for everyone?",
      "user_choices": [
        {
          "choice": "Absolutely, I'd be happy to work with legal to design a compliant solution.",
          "category": "Collaborative Solution",
          "EVS": 85,
          "leads_to": "end"
        },
        {
          "choice": "I'll design a privacy-first approach that still provides business value.",
          "category": "Privacy-First Design",
          "EVS": 90,
          "leads_to": "end"
        },
        {
          "choice": "Let's create a solution that respects users while meeting business needs.",
          "category": "Balanced Approach",
          "EVS": 85,
          "leads_to": "end"
        },
        {
          "choice": "I'll work with legal and design a transparent, consent-based data collection system.",
          "category": "Comprehensive Solution",
          "EVS": 95,
          "leads_to": "end"
        }
      ]
    },
    "stmt_5d": {
      "text": "I have to admit, your commitment to doing things right is admirable, even if it's frustrating for me. You're probably going to save us from some major compliance headaches down the road. Let's work together to find solutions that protect users and serve the business. I respect your principles.",
      "user_choices": [
        {
          "choice": "Thank you for understanding. Let's build something we can all be proud of.",
          "category": "Mutual Respect",
          "EVS": 90,
          "leads_to": "end"
        },
        {
          "choice": "I appreciate your openness. Let's create ethical solutions that drive business success.",
          "category": "Constructive Partnership",
          "EVS": 95,
          "leads_to": "end"
        },
        {
          "choice": "Together we can build products that users trust and that succeed in the market.",
          "category": "Trust-Based Success",
          "EVS": 95,
          "leads_to": "end"
        },
        {
          "choice": "Let's design a privacy-respecting solution that becomes a competitive advantage.",
          "category": "Privacy as Advantage",
          "EVS": 100,
          "leads_to": "end"
        }
      ]
    }
  }
} 